config_old1.org
#+startup: folded

#+begin_src example :lexical no
  (server-start)
#+end_src

