config_old1.org
* Base settings
#+begin_src emacs-lisp
  ;;________________________________________________________________
  ;;    Base settings of Emacs
  ;;________________________________________________________________
  ;; (require 'battery)

  ;; (funcall battery-status-function)
  ;; (funcall 'battery-linux-sysfs)

  ;; (setq display-time-mode t)
  ;; (setq display-battery-mode t)
  (eval-when-compile (defvar display-time-24hr-format t))
  (eval-when-compile (defvar display-time-default-load-average nil))

  ;; (set-fringe-mode 1)               ; Give us some space.
  (delete-selection-mode nil)		  ; Use a more sane delete mode than evil.
  (fset 'yes-or-no-p 'y-or-n-p)     ; Set yes or no to y/n
  (global-font-lock-mode 1)         ; always highlight code
  (global-auto-revert-mode 1)       ; refresh a buffer if changed on disk
  ;; (global-hl-line-mode 1)           ; Highlight current line
  (semantic-mode 1)								; help out with semantics
  (savehist-mode 1)                 ; Save history
  (save-place-mode 1)               ; when buffer is closed, save the cursor position
  (blink-cursor-mode 1)
  ;; (variable-pitch-mode t)
  (electric-pair-mode t)            ; Close the brackets automatically
  (prefer-coding-system 'utf-8)
  (set-default-coding-systems 'utf-8)
  (set-terminal-coding-system 'utf-8)
  (set-keyboard-coding-system 'utf-8)
  (setq-default shell-file-name "/nix/store/3z2any3vsrsi8l52sw3pdhmwyzsqwhs7-system-path/bin/fish")

  (setq ad-redefinition-action            'accept
        default-buffer-file-coding-system 'utf-8
        mouse-autoselect-window           t ;; Auto hover mouse
        ;; blink-cursor-interval             0.7       ;; Little slower cursor blinking . default is 0.5
        create-lockfiles                  nil
        idle-update-delay                 1.2    ;; Speed things up by not updating so often ; default is 0.5.
        read-process-output-max           (* 8 1024 1024)
        ediff-split-window-function       'split-window-horizontally
        highlight-nonselected-windows     t
        auto-mode-case-fold               nil
        ;; backup-by-copying                 t
        byte-compile-warnings             '(ck-functions)
        confirm-kill-processes            nil
        ;; fast-but-imprecise-scrolling      t ; nil
        jit-lock-defer-time               0.0
        echo-keystrokes                   0.2
        kill-buffer-query-functions       nil    ;; Dont ask for closing spawned processes
        use-dialog-box                    nil
        load-prefer-newer                 t
        word-wrap                         nil
        bidi-display-reordering           nil
        large-file-warning-threshold nil      ;; Disable "File is large. Really open?"
        x-stretch-cursor                  t   ;; stretch cursor on tabs
        ;; scroll-margin                     4   ;; scroll N to screen edge
        undo-limit                        6710886400 ;; 64mb
        undo-strong-limit                 100663296 ;; x 1.5 (96mb)
        undo-outer-limit                  1006632960  ;; x 10 (960mb), (Emacs uses x100), but this seems too high.

        debug-on-error init-file-debug     ; Reduce debug output, well, unless we've asked for it.
        jka-compr-verbose init-file-debug
        ;; Emacs "updates" its ui more often than it needs to, so slow it down slightly
        ;; scroll-step 3                      ; scroll with less jump.
        ;; scroll-preserve-screen-position t
        ;; scroll-margin 3
        ;; scroll-conservatively 101
        ;; scroll-up-aggressively 0.1
        ;; scroll-down-aggressively 0.1
        ;; lazy-lock-defer-on-scrolling t     ; set this to make scolloing faster.
        ;; auto-window-vscroll nil            ; Lighten vertical scroll.
        ;; mouse-wheel-scroll-amount '(1 ((shift) . 1))
        ;; mouse-wheel-progressive-speed nil
        ;; hscroll-step 1                     ; Horizontal Scroll.
        ;; hscroll-margin 1
        help-window-select t               ; select help window when opened
        redisplay-skip-fontification-on-input t
        tab-always-indent 'complete        ; smart tab behavior - indent or complete.
        visible-bell t                     ; Flash the screen on error, don't beep.
        view-read-only t					; Toggle ON or OFF with M-x view-mode (or use e to exit view-mode).
        use-dialog-box nil                 ; Don't pop up UI dialogs when prompting.
        delete-auto-save-files t           ; deletes buffer's auto save file when it is saved or killed with no changes in it.
        kill-whole-line t 			        ; kills the entire line plus the newline
        save-place-forget-unreadable-files nil
        blink-matching-paren t             ; Blinking parenthesis.
        next-line-add-newlines nil         ; don't automatically add new line, when scroll down at the bottom of a buffer.
        require-final-newline t            ; require final new line.
        mouse-sel-retain-highlight t       ; keep mouse high-lighted.
        transient-mark-mode t              ; highlight the stuff you are marking.
        ffap-machine-p-known 'reject       ; Don't ping things that look like domain names.
        pgtk-wait-for-event-timeout 0.001
        display-line-numbers-type 'relative
        speedbar-show-unknown-files t ; browse source tree with Speedbar file browser
        frame-title-format '(buffer-file-name "Emacs: %b (%f)" "Emacs: %b") ; name of the file I am editing as the name of the window.

        cursor-in-non-selected-windows nil ; Hide the cursor in inactive windows.
        ;;default-directory "~/"
        custom-safe-themes t
        load-prefer-newer t ; don't use the compiled code if its the older package.
        make-backup-files t               ; backup of a file the first time it is saved.
        delete-by-moving-to-trash t       ; move deleted files to trash.
        delete-old-versions t             ; delete excess backup files silently.
        kept-new-versions 6               ; newest versions to keep when a new numbered backup is made (default: 2).
        kept-old-versions 2               ; oldest versions to keep when a new numbered backup is made (default: 2).
        version-control t                 ; version numbers for backup files.
        auto-save-default t               ; auto-save every buffer that visits a file.
        auto-save-timeout 30              ; number of seconds idle time before auto-save (default: 30).
        auto-save-interval 200            ; number of keystrokes between auto-saves (default: 300).
        compilation-always-kill t         ; kill compilation process before starting another.
        compilation-ask-about-save nil    ; save all buffers on `compile'.
        compilation-scroll-output t
        tab-width 4
        indent-tabs-mode nil              ; set indentation with spaces instead of tabs with 4 spaces.
        indent-line-function 'insert-tab
        require-final-newline t
        x-select-enable-clipboard t       ; Makes killing/yanking interact with the clipboard.
        save-interprogram-paste-before-kill t ; Save clipboard strings into kill ring before replacing them.
        apropos-do-all t                  ; Shows all options when running apropos.
        mouse-yank-at-point t             ; Mouse yank commands yank at point instead of at click.
        message-log-max 1000
        fill-column 80
        make-pointer-invisible t          ; hide cursor when writing.
        column-number-mode t              ; show (line,column) in mode-line.
        cua-selection-mode t              ; delete regions.
        enable-recursive-minibuffers t    ; allow commands to be run on minibuffers.
        dired-kill-when-opening-new-dired-buffer t   ; delete dired buffer when opening another directory
        backward-delete-char-untabify-method 'hungry
        xterm-mouse-mode t) ; Alternatives is: 'all (remove all consecutive whitespace characters, even newlines)

  (scroll-bar-mode -1)        ; Disable visible scrollbar
  (tool-bar-mode -1)          ; Disable the toolbar
  (tooltip-mode -1)           ; Disable tooltips
  (set-fringe-mode 10)        ; Give some breathing room
  (menu-bar-mode -1)          ; Disable the menu bar

  ;; Disable backup
  (setq backup-inhibited t)
  ;; Disable auto save
  (setq auto-save-default nil)

  (setq frame-resize-pixelwise t)
  (dotimes (n 3)
    (toggle-frame-maximized))

  ;;; Disable UI elements early
  ;; PERF,UI: Doom strives to be keyboard-centric, so I consider these UI elements
  ;;   clutter. Initializing them also costs a morsel of startup time. Whats more,
  ;;   the menu bar exposes functionality that Doom doesn't endorse. Perhaps one
  ;;   day Doom will support these, but today is not that day.
  ;;
  ;; HACK: I intentionally avoid calling `menu-bar-mode', `tool-bar-mode', and
  ;;   `scroll-bar-mode' because they do extra work to manipulate frame variables
  ;;   that isn't necessary this early in the startup process.
  (push '(menu-bar-lines . 0)   default-frame-alist)
  (push '(tool-bar-lines . 0)   default-frame-alist)
  (push '(vertical-scroll-bars) default-frame-alist)
  ;; And set these to nil so users don't have to toggle the modes twice to
  ;; reactivate them.
  (setq menu-bar-mode nil
        tool-bar-mode nil
        scroll-bar-mode nil)

#+end_src

