config_old1.org
** Evil
#+begin_src emacs-lisp
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  ;; ;;;;;;;;;;;;;;;;;;;;;;;; ;;
  ;; ;;     NAVIGATION     ;; ;;
  ;; ;;;;;;;;;;;;;;;;;;;;;;;; ;;
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  (use-package evil
    :init      ;; tweak evil's configuration before loading it
    (setq evil-want-integration t) ;; This is optional since it's already set to t by default.
    (setq evil-want-keybinding nil)
    (setq evil-vsplit-window-right t)
    (setq evil-split-window-below t)
    (evil-mode))

  ;; (use-package general
  ;;   :after evil
  ;;   :config
  ;;   (general-evil-setup t))

  (use-package evil-collection
    :defer nil
    :after evil
    :config
    (setq evil-emacs-state-cursor '("#FF5D62" box))
    (setq evil-normal-state-cursor '("#FF5D62" box))
    (setq evil-visual-state-cursor '("#98BB6C" box))
    (setq evil-insert-state-cursor '("#E82424" bar))
    (setq evil-replace-state-cursor '("#FF9E3B" hbar))
    (setq evil-operator-state-cursor '("#7E9CD8" hollow))
    (evil-set-initial-state 'ibuffer-mode 'normal)
    (evil-set-initial-state 'bookmark-bmenu-mode 'normal)
    (evil-set-initial-state 'vterm-mode 'normal)
    (evil-set-initial-state 'calibredb-mode 'normal)
    (evil-set-initial-state 'org-timeblock-mode 'emacs)
    (evil-set-initial-state 'org-timeblock-list-mode 'emacs)
    ;; (evil-set-initial-state 'dired-mode 'emacs)
    (evil-set-initial-state 'treemacs-mode 'emacs)
    (evil-set-initial-state 'xwidget-webkit-mode 'emacs)
    (evil-set-initial-state 'sunrise-mode 'emacs)
    (evil-collection-init))

#+end_src
* Appereance
#+begin_src emacs-lisp :lexical no
  (global-hl-line-mode t)

  ;; (use-package indent-guide
  ;;   :hook (prog-mode . indent-guide-mode)
  ;;   

  ;; hl-volatile
  ;; (use-package volatile-highlights
  ;;   :diminish
  ;;   :commands volatile-highlights-mode
  ;;   :hook (after-init . volatile-highlights-mode)
  ;;   :custom-face
  ;;   (vhl/default-face ((nil (:foreground "#FF3333" :background "BlanchedAlmond"))))) ; "#FFCDCD"

  (use-package rainbow-delimiters
    :hook
    (prog-mode . rainbow-delimiters-mode))

  (use-package which-key
    :config (which-key-mode))
#+end_src

#+RESULTS:
: t

** Fonts
#+begin_src emacs-lisp
     ;;________________________________________________________________
     ;;    Setup fonts
     ;;________________________________________________________________
     (set-face-attribute 'default t
                         :font "Iosevka" ;; Hack, Input, Terminess, Nerd, Font Propo
                         :height 150
                         :weight 'medium)
     (set-face-attribute 'variable-pitch nil
                         :font "Iosevka"
                         :height 150
                         :weight 'regular)
     (set-face-attribute 'fixed-pitch nil
                         :font "Iosevka"
                         :height 150
                         :weight 'medium)

     ;; Needed if using emacsclient. Otherwise, your fonts will be smaller than expected.
     (add-to-list 'default-frame-alist '(font . "Iosevka 15"))
     (add-to-list 'default-frame-alist
                  '(font . "Iosevka 15"))
     (add-to-list 'default-frame-alist '(font . "Iosevka 15"))

     ;; Changes certain keywords to symbols, such as lamda
     (setq global-prettify-symbols-mode t)
#+end_src

#+RESULTS:
: t

** Icons
#+begin_src emacs-lisp
  (use-package all-the-icons
    ;; :demand t
    ;; :ensure t
    :if (display-graphic-p)
    :config
    ;; Make sure the icon fonts are good to go
    ;; (set-fontset-font t 'unicode (font-spec :family "all-the-icons") nil 'append)
    (set-fontset-font t 'unicode (font-spec :family "file-icons") nil 'append)
    (set-fontset-font t 'unicode (font-spec :family "Material Icons") nil 'append)
    (set-fontset-font t 'unicode (font-spec :family "github-octicons") nil 'append)
    (set-fontset-font t 'unicode (font-spec :family "FontAwesome") nil 'append)
    (set-fontset-font t 'unicode (font-spec :family "Weather Icons") nil 'append))

#+end_src

#+RESULTS:
: t

** Ligature
#+begin_src emacs-lisp
  (use-package ligature
    :config
    ;; Enable the "www" ligature in every possible major mode
    (ligature-set-ligatures 't '("www"))
    ;; Enable traditional ligature support in eww-mode, if the
    ;; `variable-pitch' face supports it
    (ligature-set-ligatures 'eww-mode '("ff" "fi" "ffi"))
    ;; Enable all Cascadia Code ligatures in programming modes
    (ligature-set-ligatures 'prog-mode '("|||>" "<|||" "<==>" "<!--" "####" "~~>" "***" "||=" "||>"
                                         ":::" "::=" "=:=" "===" "==>" "=!=" "=>>" "=<<" "=/=" "!=="
                                         "!!." ">=>" ">>=" ">>>" ">>-" ">->" "->>" "-->" "---" "-<<"
                                         "<~~" "<~>" "<*>" "<||" "<|>" "<$>" "<==" "<=>" "<=<" "<->"
                                         "<--" "<-<" "<<=" "<<-" "<<<" "<+>" "</>" "###" "#_(" "..<"
                                         "..." "+++" "/==" "///" "_|_" "www" "&&" "^=" "~~" "~@" "~="
                                         "~>" "~-" "**" "*>" "*/" "||" "|}" "|]" "|=" "|>" "|-" "{|"
                                         "[|" "]#" "::" ":=" ":>" ":<" "$>" "==" "=>" "!=" "!!" ">:"
                                         ">=" ">>" ">-" "-~" "-|" "->" "--" "-<" "<~" "<*" "<|" "<:"
                                         "<$" "<=" "<>" "<-" "<<" "<+" "</" "#{" "#[" "#:" "#=" "#!"
                                         "##" "#(" "#?" "#_" "%%" ".=" ".-" ".." ".?" "+>" "++" "?:"
                                         "?=" "?." "??" ";;" "/*" "/=" "/>" "//" "__" "~~" "(*" "*)"
                                         "\\\\" "://"))
    ;; Enables ligature checks globally in all buffers. You can also do it
    ;; per mode with `ligature-mode'.
    (global-ligature-mode t))

#+end_src
** Theme
#+begin_src emacs-lisp
  ;;________________________________________________________________
  ;;    Setup theme
  ;;________________________________________________________________
  ;; (use-package nano-theme
  ;;   :straight (nano-theme :type git
  ;;       			:host github
  ;;       			:repo "rougier/nano-theme"))

  (use-package doom-themes
    :if window-system
    :config
    (setq doom-themes-enable-bold t
          doom-themes-enable-italic t)
    (doom-themes-visual-bell-config) ; Enable flashing mode-line on errors
    (if (display-graphic-p)
        (progn
          (setq doom-themes-treemacs-theme "doom-colors") ; use the colorful treemacs theme
          (doom-themes-treemacs-config)))
    ;; Corrects (and improves) org-mode's native fontification.
    (doom-themes-org-config))

  (use-package gruvbox-theme)
  (use-package ef-themes)

  (use-package theme-changer
    :ensure t
    :demand t
    :config
    (setq calendar-location-name "Vladivostok, RU")
    (setq calendar-latitude 43.11)
    (setq calendar-longitude 131.88)
    )

  (require 'theme-changer)
  ;; (change-theme 'ef-deuteranopia-light 'ef-deuteranopia-dark)
  ;; (change-theme 'ef-spring 'ef-dark) ;; ef-trio-light / ef-maris-dark, ef-elea-dark, ef-dark
  ;; (change-theme 'nano-dark 'nano-dark) ;; ef-trio-light / ef-maris-dark, ef-elea-dark, ef-dark
  ;; (change-theme 'doom-ayu-light 'doom-ayu-mirage)
  (change-theme 'doom-one-light 'doom-one)
  ;; (load-theme 'doom-one)

  (use-package auto-dark
    :ensure t
    :config
    (setq auto-dark-dark-theme 'doom-one)
    (setq auto-dark-light-theme 'doom-one-light)
    (setq auto-dark-polling-interval-seconds 0)
    (setq auto-dark-allow-osascript nil)
    (setq auto-dark-allow-powershell nil)
    ;; (setq auto-dark-detection-method nil) ;; dangerous to be set manually

    (auto-dark-mode t))
#+end_src

#+RESULTS:
: t

