config_old1.org
** Modeline
#+begin_src emacs-lisp
  ;;________________________________________________________________
  ;;    Modeline
  ;;________________________________________________________________
  (use-package doom-modeline
    :hook (after-init . doom-modeline-mode)
    :config
    ;; (display-battery-mode 1)
    (display-time-mode 1)
    :custom
    (doom-modeline-height 25)
    (doom-modeline-bar-width 1)
    (doom-modeline-icon t)
    (doom-modeline-major-mode-icon t)
    (doom-modeline-major-mode-color-icon t)
    (doom-modeline-buffer-file-name-style 'truncate-upto-project)
    (doom-modeline-buffer-state-icon t)
    (doom-modeline-buffer-modification-icon t)
    (doom-modeline-minor-modes nil)
    (doom-modeline-enable-word-count t)
    (doom-modeline-buffer-encoding nil)
    (doom-modeline-indent-info nil)
    (doom-modeline-checker-simple-format t)
    (doom-modeline-vcs-max-length 12)
    (doom-modeline-env-version t)
    (doom-modeline-irc-stylize 'identity)
    (doom-modeline-github-timer nil)
    (doom-modeline-gnus-timer nil))

#+end_src

** Reverse im
#+begin_src emacs-lisp
  ;; Needed for `:after char-fold' to work
  (use-package char-fold
    :demand t
    :custom
    (char-fold-symmetric t)
    (search-default-mode #'char-fold-to-regexp))

  (use-package reverse-im
    :ensure t ; install `reverse-im' using package.el
    :demand t ; always load it
    :after char-fold ; but only after `char-fold' is loaded
    :bind
    ("M-T" . reverse-im-translate-word) ; fix a word in wrong layout
    :custom
    (reverse-im-char-fold t) ; use lax matching
    (reverse-im-read-char-advice-function #'reverse-im-read-char-include)
    (reverse-im-input-methods '("ukrainian-computer")) ; translate these methods
    :config
    (reverse-im-mode t)) ; turn the mode on

#+end_src

** Line numbers
#+begin_src emacs-lisp
  ;; hl-numbers
  (use-package highlight-numbers
    :hook (prog-mode . highlight-numbers-mode))

  (use-package display-line-numbers
    :ensure nil
    :hook ((prog-mode . display-line-numbers-mode))
    :config
    (setq display-line-numbers-width 3))

  (dolist (mode '(org-mode-hook ; Disable line numbers for some modes
                  org-mode-agenda-hook
                  elfeed-entry-hook
                  elfeed-new-entry-hook
                  elfeed-new-entry-parse-hook
                  term-mode-hook
                  vterm-mode-hook
                  shell-mode-hook
                  treemacs-mode-hook
                  eshell-mode-hook
                  nov-mode-hook
                  neotree-mode-hook
                  ;; pdf-view-mode-hook
                  treemacs-mode-hook))
    (add-hook mode (lambda () (display-line-numbers-mode 0))))

  (setq-default tab-width 2)
#+end_src

** Olivetti
#+begin_src emacs-lisp
  (use-package olivetti
    :hook ((text-mode         . olivetti-mode)
           (prog-mode         . olivetti-mode)
           (Info-mode         . olivetti-mode)
           (org-mode          . olivetti-mode)
           (nov-mode          . olivetti-mode)
           (markdown-mode     . olivetti-mode)
           (mu4e-view-mode    . olivetti-mode)
           (elfeed-show-mode  . olivetti-mode)
           (mu4e-compose-mode . olivetti-mode))
    :custom
    (olivetti-body-width 150)
    :delight " ⊗") ; Ⓐ ⊛

#+end_src

* Org
#+begin_src emacs-lisp :lexical no
  ;; Get rid of the background on column views
  ;; (set-face-attribute 'org-column nil :background nil)
  ;; (set-face-attribute 'org-column-title nil :background nil)
#+end_src

