config_old1.org
** Org-mode
#+begin_src emacs-lisp
  (use-package org
    :straight (:type built-in)
    :ensure nil
    ;; :defer t
    ;; :after org
    ;; :demand t
    :delight org-mode "✎"
    :hook ((org-mode . prettify-symbols-mode)
           (org-mode . visual-line-mode)
           (org-mode . variable-pitch-mode))
    :bind (("C-c l"               . org-store-link)
           ("C-c c"               . org-capture)
  	 ("C-c f"               . org-footnote-new))
    :config
    (setq
     org-ellipsis " ▾" ;; ⤵, ᗐ, ↴, ▼, ▶, ⤵, ▾
     org-roam-v2-ack t                 ; anonying startup message
     ;; org-log-done 'time                ; I need to know when a task is done
     org-hide-leading-stars t
     org-log-into-drawer t
     org-startup-folded t
     ;; org-odd-levels-only t
     org-pretty-entities t
     org-startup-indented t
     org-adapt-indentation t
     org-hide-macro-markers t
     org-hide-block-startup nil
     org-src-fontify-natively t
     org-src-tab-acts-natively t
     org-cycle-separator-lines 2
     org-startup-with-inline-images t
     org-display-remote-inline-images t
     org-src-preserve-indentation nil
     org-edit-src-content-indentation 2
     org-fontify-quote-and-verse-blocks t
     org-export-with-smart-quotes t

     org-checkbox-hierarchical-statistics nil
     org-read-date-prefer-future 'time
     org-agenda-todo-ignore-scheduled 'future
     org-agenda-tags-todo-honor-ignore-options t
     org-agenda-todo-ignore-with-date t
     org-image-actual-width '(300))

    ;; Log time a task was set to DONE.
    (setq org-log-done (quote time))

    ;; Don't log the time a task was rescheduled or redeadlined.
    (setq org-log-redeadline t) ; changed
    (setq org-log-reschedule t) ; changed

    (setq org-todo-keyword-faces
          '(
            ("TODO" :background "indian red" :foreground "white" :weight bold)
            ("DOING" :background "tomato" :foreground "white" :weight bold)
            ("NEXT" :background "sky blue" :foreground "black" :weight bold)
            ("WAITING" :background "olive drab" :foreground "black" :weight bold)
            ("STOPPED" :background "firebrick2" :foreground "white" :weight bold)
            ("REVIEW" :background "cyan" :foreground "black" :weight bold)
            ("DONE" :background "pale green" :foreground "black" :weight bold)
            ("ARCHIVED" :background "light slate blue" :foreground "white" :weight bold)
            ("CANCELLED" :background "dark red" :foreground "white" :weight bold)))

    (setq org-todo-keywords
          '((sequence "TODO(t)" "DOING(d)" "NEXT(n)" "WAITING(w)" "STOPPED(s)" "REVIEW(r)" "|" "DONE(o)" "ARCHIVED(a)" "CANCELLED(c)")))

    (set-face-attribute 'org-table nil :inherit 'fixed-pitch)
    (with-eval-after-load 'org
      (setq org-confirm-babel-evaluate nil)
      (require 'org-tempo)

      (add-hook 'org-babel-after-execute-hook (lambda ()
                                                (when org-inline-image-overlays
                                                  (org-redisplay-inline-images))))
      (add-to-list 'org-modules 'org-tempo t))
    ;; (setq org-modules
    ;; 	'(org-crypt
    ;;         org-bookmark
    ;;         org-eshell
    ;;         org-irc))

    (use-package org-habit
      :after org
      :ensure nil
      :straight (:type built-in)
      :init
      (add-to-list 'org-modules 'org-habit)
      :config
      (setq org-habit-following-days 7
            org-habit-preceding-days 7
            org-habit-show-all-today nil
            org-habit-show-habits t
            org-habit-graph-column 67)

      (defun toggle-org-habit-show-all-today ()
        "Toggle the value of `org-habit-show-all-today' between t and nil."
        (interactive)
        (setq org-habit-show-all-today (not org-habit-show-all-today))
        (message "org-habit-show-all-today is now %s"
                 (if org-habit-show-all-today "nil" "t"))
        (org-agenda-refresh))

      (define-key org-agenda-mode-map (kbd "<f12>") 'toggle-org-habit-show-all-today)

      (use-package org-habit-stats
        :config
        (add-hook 'org-after-todo-state-change-hook 'org-habit-stats-update-properties)
        (add-hook 'org-agenda-mode-hook
          	(lambda () (define-key org-agenda-mode-map "Z" 'org-habit-stats-view-next-habit-in-agenda)))))

    (require 'org-indent)

    ;; Ensure that anything that should be fixed-pitch in Org files appears that way
    (set-face-attribute 'org-block nil :foreground nil :inherit 'fixed-pitch)
    (set-face-attribute 'org-table nil  :inherit 'fixed-pitch)
    (set-face-attribute 'org-formula nil  :inherit 'fixed-pitch)
    (set-face-attribute 'org-code nil   :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-indent nil :inherit '(org-hide fixed-pitch))
    (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
    (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
    (set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch)

    ;; Setup fonts for org-mode
    (set-face-attribute 'org-block nil    :inherit 'fixed-pitch)
    (set-face-attribute 'org-table nil    :inherit 'fixed-pitch)
    (set-face-attribute 'org-formula nil  :inherit 'fixed-pitch)
    (set-face-attribute 'org-code nil     :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-table nil    :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
    (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
    (set-face-attribute 'org-checkbox nil  :inherit 'fixed-pitch)
    (set-face-attribute 'line-number nil :inherit 'fixed-pitch)
    (set-face-attribute 'line-number-current-line nil :inherit 'fixed-pitch)

    ;; ────────────────────────────── Prettify Symbols ─────────────────────────────
    ;; Beautify Org Checkbox Symbol
    (defun ma/org-buffer-setup ()
      "Something for like document, i guess 😕."
      (push '("[ ]" . "☐" ) prettify-symbols-alist)
      (push '("[X]" . "☑" ) prettify-symbols-alist)
      (push '("[-]" . "❍" ) prettify-symbols-alist))
    (add-hook 'org-mode-hook 'ma/org-buffer-setup)

    (use-package org-modern
      :hook (org-mode . org-modern-mode)
      :config
      (setq
       ;; Edit settings
       org-catch-invisible-edits 'show-and-error
       org-special-ctrl-a/e t
       ;; Appearance
       org-modern-radio-target    '("❰" t "❱")
       org-modern-internal-target '("↪ " t "")
       ;; org-modern-progress t
       ;; org-modern-statistics nil
       org-modern-todo nil
       org-modern-tag t
       org-modern-timestamp t
       org-modern-statistics t
       ;; org-modern-table nil
       org-modern-priority t
       org-modern-horizontal-rule "──────────────────────────────────────────────────────────────────────────────────────────"
       org-modern-hide-stars " "
       org-modern-keyword "‣")

      (setq org-modern-priority-faces
            (quote ((?A :background "red"
          	      :foreground "black")
          	  (?B :background "dark orange"
          	      :foreground "black")
          	  (?C :background "tan"
          	      :foreground "black")))))

    ;; Toggle visibility of hidden Org mode element parts upon entering and leaving an element
    (use-package org-appear
      :hook
      (org-mode . org-appear-mode)
      :config
      (setq org-hide-emphasis-markers t
            org-appear-autolinks 'just-brackets))

    ;(use-package org-transclusion
    ;  :after org
    ;  :config
    ;  (define-key global-map (kbd "<f12>") #'org-transclusion-add)
    ;  (define-key global-map (kbd "C-c t") #'org-transclusion-mode))

    (use-package org-download
      :demand t
      :bind (:map org-mode-map
    		("C-x p m"    . org-download-clipboard)
    		("C-x p o"    . org-download-image))
      :config
      (setq-default org-download-image-dir "./assets-org/"))

    (use-package org-analyzer)

    (use-package counsel-jq)
    
    (use-package tsc)
    (use-package ob-typescript)
    (use-package ob-http)
    (use-package ob-rust)
    (use-package ob-go)
    (use-package ob-solidity)
    (use-package ob-sql-mode)
    (org-babel-do-load-languages
     'org-babel-load-languages
     '((emacs-lisp . t)
       (http       . t)
       (js         . t)
       (solidity   . t)
       (typescript . t)
       (shell      . t)
       (python     . t)
       (rust       . t)
       (go         . t)
       (C          . t)
       (sql        . t))))
  ;; (latex      . t)
#+end_src

