config_old1.el

(use-package toc-org
  :config
  (if (require 'toc-org nil t)
      (progn
      (add-hook 'org-mode-hook 'toc-org-mode)

      ;; enable in markdown, too
      ;; (add-hook 'markdown-mode-hook 'toc-org-mode)
      ;; (define-key markdown-mode-map (kbd "\C-c\C-o") 'toc-org-markdown-follow-thing-at-point)
      )
    (warn "toc-org not found")))

(use-package org-reverse-datetree)

;; "%Y"                    ; year
;; (lambda (time) (format-time-string "%Y-%m %B" (org-reverse-datetree-monday time))) ; month
;; "%Y-%m-%d %A"           ; date
(setq-default org-reverse-datetree-level-formats
              '("Week №%W {%B-%Y}")) ; week

(setq org-capture-templates
      '(("c" "New task (GTD)" entry (file "~/Org/agenda/GTD/Inbox.org")
         "* TODO %?")

              ("p" "PROGRAMMING (week's task)" entry (file+function "~/Org/agenda/PlanAhead.org"
    							    (lambda () (org-reverse-datetree-goto-date-in-file nil :olp '("💻 Programming 👾"))))
         "* TODO %?\nSCHEDULED: %t DEADLINE: %t" :clock-in t)

              ("m" "Meeting" entry (file+function "~/Org/Meetings.org" (lambda () (org-reverse-datetree-goto-date-in-file nil :olp '("Meetings"))))
       "* Meeting for %U\nSCHEDULED: %U"
       :clock-in t
         :time-prompt t)

      ("e" "EXAMS (week's task)" entry (file+function "~/Org/agenda/PlanAhead.org" (lambda () (org-reverse-datetree-goto-date-in-file nil :olp '("📖 Exams 📖"))))
         "* TODO %?\nSCHEDULED: %t DEADLINE: %t")

      ("l" "PERSONAL LIFE (week's task)" entry (file+function "~/Org/agenda/PlanAhead.org" (lambda () (org-reverse-datetree-goto-date-in-file nil :olp '("💁 Personal life 🤷"))))
         "* TODO %?\nSCHEDULED: %t DEADLINE: %t")
      ;; ("b" "Book for month" entry (file+datetree "~/Org/agenda/ReadAhead.org")
      ;;  "* TODO %?\nSCHEDULED: %t--%t DEADLINE: %t" :tree-type month)
      ))

;; ("c" "Book (paste from clipboard)" entry (file "~/Org/agenda/Reading-list.org")
;;  "%(let* ((url (substring-no-properties (current-kill 0)))
;;                       (details (org-books-get-details url)))
;;                  (when details (apply #'org-books-format 1 details)))")

;; ("l" "Book log" item (function org-books-visit-book-log)
;;  "- %U %?" :prepend t)

(setq org-datetree-add-timestamp t)

(defadvice org-schedule (after refresh-agenda activate)
  "Refresh org-agenda."
  (org-agenda-refresh))

(use-package org-notifications
  :init
  (setq org-clock-sound "~/.emacs.d/sounds/sound.wav")
  (org-notifications-start))

(use-package org-cliplink
  :demand t
  :config
  (global-set-key (kbd "C-x p i") 'org-cliplink))

(use-package org-pomodoro
  :straight (:host github :repo "marcinkoziej/org-pomodoro" :branch "master")
  :bind (("C-c k"               . org-pomodoro))
  :config
  ;; First of all you sould install aplay or afplay
  (use-package sound-wav
    :demand t) ;; dep for org-pomodoro
  (use-package powershell
    :demand t) ;; dep for org-pomodoro
  (setq org-pomodoro-length 35
      org-pomodoro-short-break-length 5
      org-pomodoro-long-break-length 15
      org-pomodoro-long-break-frequency 4
      org-pomodoro-play-sounds 1

      org-pomodoro-finished-sound "/home/berezhnev/.emacs.d/sounds/sound.wav"
      org-pomodoro-long-break-sound "/home/berezhnev/.emacs.d/sounds/sound.wav"
      org-pomodoro-short-break-sound "/home/berezhnev/.emacs.d/sounds/sound.wav"))

(use-package org-clock-budget
  :straight (:host github :repo "Fuco1/org-clock-budget" :branch "master"))

;; (use-package org-ql)

;; (use-package org-books
;;   :config
;;   (setq org-books-file "~/Org/agenda/Reading-list.org"))

;; (use-package focus
;;   :demand t
;;   :config
;;   ;; '((prog-mode . defun) (text-mode . sentence) (org-mode . sentence))
;;   (focus-mode 1)
;;   (add-to-list 'focus-mode-to-thing '(org-mode . org-element)))

;; (use-package darkroom
;;   :config
;;   (setq darkroom-text-scale-increase 1))

;; (use-package org-anki) ;; https://github.com/eyeinsky/org-anki/
;; (use-package anki-editor)  ;; https://github.com/louietan/anki-editor

;; (use-package calfw
;;   :config
;;   (setq calendar-week-start-day 1)
;;   (setq cfw:org-agenda-schedule-args '(:timestamp))) ; 0:Sunday, 1:Monday

;; (use-package org-timeblock
;;   :straight (org-timeblock :type git
;;     			   :host github
;;     			   :repo "ichernyshovvv/org-timeblock")
;;   :bind
;;   (:map global-map
;;     	("C-c s" . org-timeblock))
;;   :config
;;   (setq org-timeblock-inbox-file "/home/berezhnev/Org/agenda/PlanAhead.org")
;;   (setq org-timeblock-n-days-view 5)
;;   (setq org-timeblock-tag-colors '(("school" " #ffff00" "#000000")
;;     				   ("programming" "#d60000" "#000000")
;;     				   ("exams" "#8e24aa" "#000000")
;;     				   ("languages" "#0b8043" "#000000")
;;     				   ("german" "#0b8043" "#000000")
;;     				   ("ananasya" "#f5511d" "#000000")
;;     				   ("violin" "#33b679" "#000000")
;;     				   ("diary" "#e67c73" "#000000")
;;     				   ("home" "#616161" "#000000")
;;     				   ("books" "#0b8043" "#000000")
;;     				   ("sleep" "#005f8b" "#fff")
;;     				   ("meditation" "#7cfc00" "#00000"))))

;; (setq org-padding-block-begin-line-padding '(2.0 . nil))
;; (setq org-padding-block-end-line-padding '(nil . 1.0))
;; (setq org-padding-heading-padding-alist
;;   '((4.0 . 1.5) (3.0 . 0.5) (3.0 . 0.5) (3.0 . 0.5) (2.5 . 0.5) (2.0 . 0.5) (1.5 . 0.5) (0.5 . 0.5)))

;; (use-package org-timeline
;;   :config
;;   (add-hook 'org-agenda-finalize-hook 'org-timeline-insert-timeline :append))

;; (use-package org-treescope
;;   :custom
;;   (org-treescope-cyclestates-todo '(nil ("TODO") ("WAITING" "DONE")))
;;   ;; (org-treescope-cyclestates-priority '(nil ("A" "B" "C") ("D")))
;;   :bind
;;   (("C-c M-t" . org-treescope)))
