config_old1.org
** Org-agenda
#+begin_src emacs-lisp
  ;; Refresh org-agenda after rescheduling a task.
  (defun org-agenda-refresh ()
    "Refresh all `org-agenda' buffers."
    (dolist (buffer (buffer-list))
      (with-current-buffer buffer
        (when (derived-mode-p 'org-agenda-mode)
          (org-agenda-maybe-redo)))))

  (use-package org-agenda
    :ensure nil
    :straight (:type built-in)
    :bind
    (:map global-map
          ("C-c a" . org-agenda))
    :config
    (use-package org-super-agenda
      :demand t)

    (setq org-agenda-files
          '("~/Org/agenda/PlanAhead.org"
            "~/Org/agenda/Habits.org"))

    (setq org-default-notes-file "~/Org/agenda/Notes.org")

    ;; Set default column view headings: Task Total-Time Time-Stamp
    ;; (setq org-columns-default-format "%50ITEM(Task) %10CLOCKSUM %16TIMESTAMP_IA")

    (setq org-agenda-skip-scheduled-if-done nil ; changed
          org-agenda-skip-deadline-if-done nil ; changed
          org-agenda-include-deadlines t
          org-agenda-block-separator #x2501
          org-agenda-compact-blocks t ; changed
          org-agenda-start-with-log-mode nil)

    ;; (setq org-agenda-clockreport-parameter-plist
    ;;       (quote (:link t :maxlevel 5 :fileskip t :compact t :narrow 80)))

    (setq org-agenda-deadline-faces
          '((1.0001 . org-warning)              ; due yesterday or before
        	  (0.0    . org-upcoming-deadline)))  ; due today or later(setq-default org-icalendar-include-todo t)

    ;; (setq calendar-date-style 'european
    ;;       calendar-mark-holidays-flag t
    ;;       calendar-week-start-day 1)

    (setq org-icalendar-combined-name "Hugo Org")
    (setq org-icalendar-use-scheduled '(todo-start event-if-todo event-if-not-todo))
    (setq org-icalendar-use-deadline '(todo-due event-if-todo event-if-not-todo))
    (setq org-icalendar-timezone "Asia/Vladivostok")
    (setq org-icalendar-store-UID t)
    (setq org-icalendar-alarm-time 30)
    (setq calendar-date-style 'european
          calendar-mark-holidays-flag t
          calendar-week-start-day 1
          calendar-mark-diary-entries-flag nil)

    (defun my/style-org-agenda()
      (set-face-attribute 'org-agenda-date nil :height 1.1)
      (set-face-attribute 'org-agenda-date-today nil :height 1.1 :slant 'italic)
      (set-face-attribute 'org-agenda-date-weekend nil :height 1.1))
    (add-hook 'org-agenda-mode-hook 'my/style-org-agenda)

    (setq org-agenda-breadcrumbs-separator " ❱ "
          org-agenda-current-time-string "⏰ ┈┈┈┈┈┈┈┈┈┈┈ now"
          org-agenda-time-grid '((weekly today require-timed)
                                 (800 1000 1200 1400 1600 1800 2000)
                                 "---" "┈┈┈┈┈┈┈┈┈┈┈┈┈")
          ;; org-agenda-time-grid (quote ((daily today remove-match)
          ;; 			     (800 1200 1600 2000)
          ;; 			     "......" "----------------"))
          org-agenda-prefix-format '((agenda . "%i %-12:c%?-12t% s") ;; use "%i %-12:c%?-12t%b% s" to display path
        														 (todo . " %i %-12:c")
        														 (tags . " %i %-12:c")
        														 (search . " %i %-12:c")))

    (setq org-agenda-format-date (lambda (date) (concat "\n" (make-string (window-width) 9472)
                      																	"\n"
                      																	(org-agenda-format-date-aligned date))))

    (regexp-opt '("Tasks" "Notes"))
    (setq org-refile-targets
        	'(("Projects.org" :regexp . "\\(?:\\(?:Note\\|Task\\)s\\)")))
    (setq org-refile-use-outline-path 'file)
    (setq org-outline-path-complete-in-steps nil)

    (setq org-refile-targets '((org-agenda-files . (:maxlevel . 6))))
    (setq org-refile-use-outline-path 'file)
    (setq org-refile-allow-creating-parent-nodes 'confirm)

    (setq org-agenda-custom-commands
          '(("z" "Getting Things Done (GTD)"
        	   ((agenda "" ((org-agenda-span 'day)
        									(org-agenda-skip-scheduled-if-done t)
          								(org-agenda-skip-deadline-if-done t)
          								(org-agenda-include-deadlines nil)
  												(org-agenda-prefix-format '((agenda . "%i %?-12t% s") ;; use "%i %-12:c%?-12t%b% s" to display path
        																							(todo . " %i %-12:c")
        																							(tags . " %i %-12:c")
        																							(search . " %i %-12:c")))

                          (org-agenda-files '("~/Org/agenda/PlanAhead.org"
        																			"~/Org/agenda/GTD/Inbox.org"))
                          (org-super-agenda-groups
                           '((:name "Schedule"
      															:time-grid t)
  													 (:name "School / exams"
  																	:and (:tag "school" :deadline future)
  																	:face (:background "yellow" :foreground "black"))
     												 (:name "Today"
    																:scheduled today
  																	:face (:background "medium sea green" :foreground "white"))
    												 (:name "Deadline today"
    																:deadline today
  																	:face (:background "black" :foreground "white"))
  													 (:name "Passed deadline"
  																	:deadline past
  																	:face (:background "firebrick"))
  													 (:name "Future deadline"
  																	:deadline future
  																	:face (:background "dark slate blue"))
  													 ))))

        	    (alltodo "" ((org-agenda-overriding-header "")
        									 ;; (org-agenda-prefix-format "  %i %-12:c [%e] ") ;// + deadline
        									 (org-agenda-prefix-format "  %?-12t% s")
      										 (org-agenda-entry-text-mode t)
        									 (org-agenda-files '("~/Org/agenda/GTD/Inbox.org")) ;; "~/Org/agenda/GTD/Projects.org"
         									 (org-super-agenda-groups
        										'((:name "Inbox"
  																	 :children t
        														 :and (:tag "inbox" :todo "TODO"))))))

        	    (tags "CLOSED>=\"<today>\""
        						((org-agenda-overriding-header "\nCompleted today\n")))))

        	  ("v" "Reading view (by tags)"
  					 ((todo "" ((org-agenda-overriding-header "")
        								(org-agenda-start-with-log-mode '(closed))
        								(org-agenda-files '("~/Org/agenda/ReadAhead.org" "~/Org/agenda/Reading-list.org"))
        								(org-super-agenda-groups
        								 '((:name "In progress / Reading"
  																:face (:background "dark slate blue")
    															:todo ("READING" "TODO")))

    										 (:name "Should read"
    														:and (:todo "IN-PLANS"))

    										 (:name "On Zettelkasting"
    														:todo "ZETTEL")

    										 (:name "Paused reading"
    														:todo "PAUSED")

    										 (:name "Planned to read"
    														:todo "NEXT-TO-READ")

    										 (:name "Today deadline"
    														:deadline today
    														:face (:background "black"))
    										 (:name "Passed deadline"
    														:and (:deadline past)
    														:face (:background "firebrick"))

    										 (:name "Read books"
    														:todo "READ")
    										 (:name "Dropped books"
    														:todo "DROPPED")
    										 (:name "All books"
    														:and (:tag "books" :todo "IN-PLANS")))))))

        	  ("x" "Habits view"
        	   ((agenda "" ((org-agenda-span 'day)
        									;; (org-agenda-prefix-format '((agenda . "%b ∘ %s %(scheduled)")))
        									;; (org-agenda-prefix-format '((agenda . "%-12:c%?-12t% s")))
      										;; (org-agenda-prefix-format "  %?-12t% s")
      										(org-agenda-prefix-format "  %t %s")
    											(org-agenda-files '("~/Org/agenda/Habits.org"))
    											(org-super-agenda-groups
    											 '((:name "Everytime habits"
                            				:and (:tag "habits" :tag "everytime"))
                             (:name "Morning habits"
                            				:and (:tag "habits" :tag "morning"))
                             (:name "Day habits"
                            				:and (:tag "habits" :tag "day"))
                             (:name "Evening habits"
                            				:and (:tag "habits" :tag "evening"))
                             (:name "Sport habits"
                            				:and (:tag "habits" :tag "sport"))
                             (:name "Challenges"
                            				:and (:tag "habits" :tag "challenge"))
                             (:discard (:anything))
                             (:discard (:not (:tag "habits")))))))))))

    (add-hook 'org-agenda-mode-hook 'org-super-agenda-mode))
#+end_src

#+RESULTS:
: org-agenda

