config_old1.org
** Org roam
 #+begin_src emacs-lisp :lexical no
   (use-package org-roam
     :bind (("C-c n l" . org-roam-buffer-toggle)
            ("C-c n f" . org-roam-node-find)
            ("C-c n i" . org-roam-node-insert)
            ("C-c n c" . org-roam-capture)
            ("C-c n t" . org-roam-tag-add)
            ("C-c n r" . org-roam-ref-add)
            ("C-c g" . org-id-get-create)
            ("C-c n j" . org-roam-dailies-capture-today)
            :map org-mode-map
            ("C-M-i"    . completion-at-point))
     :custom
     (org-roam-directory (file-truename "~/Org/Org-roam"))
     (org-roam-completion-everywhere t)
     (org-roam-capture-templates
      '(("a" "Atomic note (with source)" plain (file "~/Org/Templates/Atomic note.org")
         :if-new
         (file+head "%<%Y-%m-%d-%H:%M>--${slug}.org" "#+startup: latexpreview\n#+date: %U\n#+title: ${title}\n")
         :unnarrowed t)
        ("t" "Thought" plain "%?"
         :if-new (file+head "thoughts/%<%Y-%m-%d-%H:%M>--thought-${slug}.org" "#+title: ${title}\n#+filetags: :Thought:\n#+date: %U\n\n\n* See also:\n+ ")
         :unnarrowed t)

        ("b" "Biography (Person)" plain (file "~/Org/Templates/Person.org")
         :if-new (file+head "persons/%<%Y-%m-%d-%H:%M>--person-${slug}.org" "#+title: ${title}\n#+filetags: :Biography:\n#+date: %U\n")
         :unnarrowed t)

        ;; ("m" "Meeting" plain (file "~/Org/Templates/Meeting.org")
        ;;  :if-new (file+head "meetings/%<%Y-%m-%d-%H:%M>--meeting-${slug}.org" "#+title: ${title}\n#+filetags: :Meeting:\n#+date: %U\n")
        ;;  :unnarrowed t)

        ("p" "Project" plain (file "~/Org/Templates/Project.org")
         :if-new (file+head "projects/%<%Y-%m-%d-%H:%M>--project-${slug}.org" "#+title: ${title}\n#+filetags: :Project:\n#+date: %U\n\n")
         :unnarrowed t)

        ("r" "Bibliography reference" plain (file "~/Org/Templates/Bibliography reference.org") ; <-- template store in a separate file
         :target
         (file+head "bibliography/references/${citekey}.org" "#+title: ${title}\n#+date: %U")
         :unnarrowed t)))

     (org-roam-capture-ref-templates
      '(("r" "ref" plain
         "%?"
         :target (file+head "web/${slug}.org"
                            "#+title: ${title}\n#+roam_key: ${ref}\n#+created: %u\n#+last_modified: %U\n\n%(zp/org-protocol-insert-selection-dwim \"%i\")")
         :unnarrowed t)
        ("i" "incremental" plain
         "* %?\n%(zp/org-protocol-insert-selection-dwim \"%i\")"
         :target (file+head "web/${slug}.org"
                            "#+title: ${title}\n#+roam_key: ${ref}\n#+created: %u\n#+last_modified: %U\n\n")
         :unnarrowed t
         :empty-lines-before 1)))

     (setq epa-file-cache-passphrase-for-symmetric-encryption t)
     (org-roam-dailies-capture-templates
      '(
        ("m" "Morning diary" plain (file "~/Org/Templates/journal/Morning.org") :clock-in t :clock-resume t
         :if-new (file+head "%<%Y-%m-%d>.org" "* %U\n#+title: %U\n\n"))
        ("q" "Quotetions diary" entry "** Quotation of the day (%U)‎\n\n#+begin_quote\n%^{Quote}\n#+end_quote\n+ Author: *%^{Author of quote}*\n\n* Reflections about this quote" :clock-in t :clock-resume t
         :if-new (file+head "%<%Y-%m-%d>-quote.org" "#+title: %U\n\n"))

        ("d" "Default diary" entry "** Default (%U): «%?»‎\n\n" :clock-in t :clock-resume t
         :if-new (file+head "%<%Y-%m-%d>.org" "** %U\n#+title: %U\n\n"))

        ("e" "Evening diary" plain (file "~/Org/Templates/journal/Evening.org") :clock-in t :clock-resume t
         :if-new (file+head "%<%Y-%m-%d>.org" "* %U\n#+title: %U\n\n"))))
     :config
     ;; Org-noter integration with org-roam-bibtex
     (setq orb-preformat-keywords
   	'("title" "citekey"  "url" "author-or-editor" "keywords" "file")
   	orb-process-file-keyword t)
     (setq org-roam-dailies-directory "journal/")
     (setq org-roam-completion-everywhere t)
     (setq org-roam-database-connector 'sqlite)
     (org-roam-db-autosync-mode)
      					; Show +FILETAG in node list
      					; https://github.com/org-roam/org-roam/commit/6f5d65abd9e707b3fdb10092a9fef3b739e143dd
     (setq fill-prefix "")  ;; see https://emacs.stackexchange.com/a/38943/12999
     (setq org-roam-node-display-template
           (concat "${title:*} "
     		(propertize "${tags:20}" 'face 'org-tag)))
     (require 'org-roam-protocol)
     ;; Customize the org-roam buffer
     (add-to-list 'display-buffer-alist
                  '("\\*org-roam\\*"
                    (display-buffer-in-direction)
                    (direction . right)
                    (window-width . 0.33)
                    (window-height . fit-window-to-buffer))))
 #+end_src

 #+RESULTS:
 : completion-at-point

*** Org-roam-ui
#+begin_src emacs-lisp
  (use-package org-roam-ui
    :hook (after-init . org-roam-ui-mode)
    :config
    (setq orui-sync-theme nil
          org-roam-ui-follow t
          org-roam-ui-update-on-save t
          org-roam-ui-open-on-start nil))

#+end_src

*** Nursery (disabled)
#+begin_src example :lexical no
  (add-to-list 'load-path "~/.emacs.d/local-packages/nursery/lisp")

  (use-package org-roam-review
    :ensure nil
    :straight (:type built-in)
    :commands (org-roam-review
               org-roam-review-list-by-maturity
               org-roam-review-list-recently-added)

    ;; ;; Optional - tag all newly-created notes as seedlings.
    ;; :hook (org-roam-capture-new-node . org-roam-review-set-seedling)

    ;; ;; Optional - keybindings for applying Evergreen note properties.
    ;; :general
    ;; (:keymaps 'org-mode-map
    ;; "C-c r r" '(org-roam-review-accept :wk "accept")
    ;; "C-c r u" '(org-roam-review-bury :wk "bury")
    ;; "C-c r x" '(org-roam-review-set-excluded :wk "set excluded")
    ;; "C-c r b" '(org-roam-review-set-budding :wk "set budding")
    ;; "C-c r s" '(org-roam-review-set-seedling :wk "set seedling")
    ;; "C-c r e" '(org-roam-review-set-evergreen :wk "set evergreen"))

    ;; ;; Optional - bindings for evil-mode compatability.
    ;; :general
    ;; (:states '(normal) :keymaps 'org-roam-review-mode-map
    ;; "TAB" 'magit-section-cycle
    ;; "g r" 'org-roam-review-refresh)
    )

  (use-package org-roam-search
    :ensure nil
    :straight (:type built-in)
    :commands (org-roam-search))
  (use-package rg) ; dep for org-roam-search also please install ripgrep in your distro

  (use-package org-roam-links
    :ensure nil
    :straight (:type built-in)
    :commands (org-roam-links))
  (use-package org-drill) ; dep for org-roam-links

  (use-package org-roam-dblocks
    :ensure nil
    :straight (:type built-in)
    :hook (org-mode . org-roam-dblocks-autoupdate-mode))

  ;; (use-package org-roam-rewrite
  ;;   :commands (org-roam-rewrite-rename
  ;;              org-roam-rewrite-remove
  ;;              org-roam-rewrite-inline
  ;;              org-roam-rewrite-extract))

  ;; (use-package org-roam-slipbox
  ;;   :after org-roam
  ;;   :demand t
  ;;   :config
  ;;   (org-roam-slipbox-buffer-identification-mode +1)
  ;;   (org-roam-slipbox-tag-mode +1))
#+end_src

#+RESULTS:
| org-roam-dblocks-autoupdate-mode | #[0 \301\211\207 [imenu-create-index-function org-imenu-get-tree] 2] | org-toggle-latex-fragment | (lambda nil (set (make-local-variable 'company-backends) '(company-org-block)) (company-mode 1)) | flyspell-mode | turn-on-flyspell | variable-pitch-mode | visual-line-mode | prettify-symbols-mode | org-appear-mode | org-modern-mode | ma/org-buffer-setup | org-tempo-setup | olivetti-mode | (lambda nil (display-line-numbers-mode 0)) | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-fold-show-all append local] 5] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-babel-show-result-all append local] 5] | org-babel-result-hide-spec | org-babel-hide-all-hashes |

*** Org-roam-timestamps
#+begin_src emacs-lisp
  (use-package org-roam-timestamps
    :after org-roam
    :demand t
    :config (org-roam-timestamps-mode)
    (setq org-roam-timestamps-parent-file t)
    (setq org-roam-timestamps-remember-timestamps t))
#+end_src
*** Org roam custom functions
**** Org-roam-create-note-from-headline
#+begin_src emacs-lisp
  (defun org-roam-create-note-from-headline ()
    "Create an Org-roam note from the current headline and jump to it.

        Normally, insert the headline’s title using the ’#title:’ file-level property
        and delete the Org-mode headline. However, if the current headline has a
        Org-mode properties drawer already, keep the headline and don’t insert
        ‘#+title:'. Org-roam can extract the title from both kinds of notes, but using
        ‘#+title:’ is a bit cleaner for a short note, which Org-roam encourages."
    (interactive)
    (let ((title (nth 4 (org-heading-components)))
          (has-properties (org-get-property-block)))
      (org-cut-subtree)
      (org-roam-node-find 'other-window title nil)
      (org-paste-subtree)
      (unless has-properties
        (kill-line)
        (while (outline-next-heading)
          (org-promote)))
      (goto-char (point-min))
      (when has-properties
        (kill-line)
        (kill-line))))
#+end_src
