config_old1.org
**** Org-roam-insert-note-from-headline
#+begin_src emacs-lisp
  (defun org-roam-insert-note-from-headline ()
    "Create an Org-roam note from the current headline and jump to it.

        Normally, insert the headline’s title using the ’#title:’ file-level property
        and delete the Org-mode headline. However, if the current headline has a
        Org-mode properties drawer already, keep the headline and don’t insert
        ‘#+title:'. Org-roam can extract the title from both kinds of notes, but using
        ‘#+title:’ is a bit cleaner for a short note, which Org-roam encourages."
    (interactive)
    (let ((title (nth 4 (org-heading-components)))
          (has-properties (org-get-property-block)))
      (org-cut-subtree)
      (org-roam-node-find 'other-window title nil)
      (org-paste-subtree)
      (unless has-properties
        (kill-line)
        (while (outline-next-heading)
          (org-promote)))
      (goto-char (point-min))
      (when has-properties
        (kill-line)
        (kill-line))))
#+end_src
** Deft
#+begin_src emacs-lisp
  (use-package deft
    :bind ("<f9>" . deft)
    :config
    (setq deft-extensions '(".org")
  	deft-text-mode 'org-mode
  	deft-directory "~/Org/Notes"
  	deft-recursive nil))
#+end_src

#+RESULTS:
: deft

* Basic packages
** Projectile
 #+begin_src emacs-lisp :lexical no
   (use-package projectile
     :init
     (projectile-mode +1)
     :bind (:map projectile-mode-map
                 ("s-p" . projectile-command-map)
                 ("C-c p" . projectile-command-map))
     :config
     (setq projectile-globally-ignored-files "node_modules"))

   (defun my/highlight-todo-like-words ()
     (font-lock-add-keywords
      nil `(("\\<\\(FIXME\\|TODO\\)"
             1 font-lock-warning-face t))))
   (add-hook 'prog-mode-hook 'my/highlight-todo-like-words)
 #+end_src
** Bufferlo
#+begin_src emacs-lisp :lexical no
  (use-package bufferlo
   :ensure t
   :config
   (bufferlo-mode 1))
#+end_src

#+RESULTS:
: t

** Helm
 #+begin_src emacs-lisp :lexical no
   (use-package helm
     :demand t
     :init
     (global-set-key (kbd "C-x C-f") 'helm-find-files)
     (global-set-key (kbd "C-x b") 'helm-buffers-list)
     (global-set-key (kbd "C-x r b") 'helm-filtered-bookmarks)
     :config
     ;;(setq helm-mode 1)
     (setq
      helm-quick-update t
      helm-M-x-fuzzy-match t
      helm-buffers-fuzzy-matching t
      ;; helm-recentf-fuzzy-match t
      helm-apropos-fuzzy-match t
      helm-lisp-fuzzy-completion t
      helm-completion-in-region-fuzzy-match t
      helm-mode-fuzzy-match t
      helm-move-to-line-cycle-in-source t
      helm-scroll-amount 8
      helm-ff-file-name-history-use-recentf nil
      helm-echo-input-in-header-line nil))

   (global-set-key (kbd "M-x") 'helm-M-x)
 #+end_src
** Treemacs
#+begin_src emacs-lisp :lexical no
  (use-package treemacs
    :ensure t
    :defer t
    :init
    (with-eval-after-load 'winum
      (define-key winum-keymap (kbd "M-0") #'treemacs-select-window))
    :config
    (progn
      (setq treemacs-collapse-dirs                   (if treemacs-python-executable 3 0)
            treemacs-deferred-git-apply-delay        0.5
            treemacs-directory-name-transformer      #'identity
            treemacs-display-in-side-window          t
            treemacs-eldoc-display                   'simple
            treemacs-file-event-delay                2000
            treemacs-file-extension-regex            treemacs-last-period-regex-value
            treemacs-file-follow-delay               0.2
            treemacs-file-name-transformer           #'identity
            treemacs-follow-after-init               t
            treemacs-expand-after-init               t
            treemacs-find-workspace-method           'find-for-file-or-pick-first
            treemacs-git-command-pipe                ""
            treemacs-goto-tag-strategy               'refetch-index
            treemacs-header-scroll-indicators        '(nil . "^^^^^^")
            treemacs-hide-dot-git-directory          t
            treemacs-indentation                     2
            treemacs-indentation-string              " "
            treemacs-is-never-other-window           nil
            treemacs-max-git-entries                 5000
            treemacs-missing-project-action          'ask
            treemacs-move-forward-on-expand          nil
            treemacs-no-png-images                   nil
            treemacs-no-delete-other-windows         t
            treemacs-project-follow-cleanup          nil
            treemacs-persist-file                    (expand-file-name ".cache/treemacs-persist" user-emacs-directory)
            treemacs-position                        'left
            treemacs-read-string-input               'from-child-frame
            treemacs-recenter-distance               0.1
            treemacs-recenter-after-file-follow      nil
            treemacs-recenter-after-tag-follow       nil
            treemacs-recenter-after-project-jump     'always
            treemacs-recenter-after-project-expand   'on-distance
            treemacs-litter-directories              '("/node_modules" "/.venv" "/.cask")
            treemacs-project-follow-into-home        nil
            treemacs-show-cursor                     nil
            treemacs-show-hidden-files               t
            treemacs-silent-filewatch                nil
            treemacs-silent-refresh                  nil
            treemacs-sorting                         'alphabetic-asc
            treemacs-select-when-already-in-treemacs 'move-back
            treemacs-space-between-root-nodes        t
            treemacs-tag-follow-cleanup              t
            treemacs-tag-follow-delay                1.5
            treemacs-text-scale                      nil
            treemacs-user-mode-line-format           nil
            treemacs-user-header-line-format         nil
            treemacs-wide-toggle-width               70
            treemacs-width                           35
            treemacs-width-increment                 1
            treemacs-width-is-initially-locked       t
            treemacs-workspace-switch-cleanup        nil)

      ;; The default width and height of the icons is 22 pixels. If you are
      ;; using a Hi-DPI display, uncomment this to double the icon size.
      ;;(treemacs-resize-icons 44)

      (treemacs-follow-mode t)
      (treemacs-filewatch-mode t)
      (treemacs-fringe-indicator-mode 'always)
      (when treemacs-python-executable
        (treemacs-git-commit-diff-mode t))

      (pcase (cons (not (null (executable-find "git")))
                   (not (null treemacs-python-executable)))
        (`(t . t)
         (treemacs-git-mode 'deferred))
        (`(t . _)
         (treemacs-git-mode 'simple)))

      (treemacs-hide-gitignored-files-mode nil))
    :bind
    (:map global-map
          ("M-0"       . treemacs-select-window)
          ("C-x t 1"   . treemacs-delete-other-windows)
          ("C-x t t"   . treemacs)
          ("C-x t d"   . treemacs-select-directory)
          ("C-x t B"   . treemacs-bookmark)
          ("C-x t C-t" . treemacs-find-file)
          ("C-x t M-t" . treemacs-find-tag)))

  (use-package treemacs-evil
    :after (treemacs evil)
    :ensure t)

  (use-package treemacs-projectile
    :after (treemacs projectile)
    :ensure t)

  (use-package treemacs-icons-dired
    :hook (dired-mode . treemacs-icons-dired-enable-once)
    :ensure t)

  ;;(use-package treemacs-magit
  ;;  :after (treemacs magit)
  ;;  :ensure t)

  (use-package treemacs-persp ;;treemacs-perspective if you use perspective.el vs. persp-mode
    :after (treemacs persp-mode) ;;or perspective vs. persp-mode
    :ensure t
    :config (treemacs-set-scope-type 'Perspectives))

  (use-package treemacs-tab-bar ;;treemacs-tab-bar if you use tab-bar-mode
    :after (treemacs)
    :ensure t
    :config (treemacs-set-scope-type 'Tabs))
#+end_src
** Spelling (disabled)
 #+begin_src example :lexical no
   (use-package ispell
     ;; :bind (:map global-map
     ;; 	 ("<f8>" . ispell-word)) ; easy spell check
     :custom
     (ispell-program-name "hunspell") ; require Hunspell
     (ispell-dictionary "ru_RU")
     (ispell-personal-dictionary "~/.emacs.d/.hunspell_personal")
     ;; (ispell-local-dictionary "ru")
     (setenv "LANG" "ru_RU.UTF-8")
     (ispell-set-spellchecker-params)
     (ispell-hunspell-add-multi-dic ispell-dictionary)
     (unless (file-exists-p ispell-personal-dictionary)
       (write-region "" nil ispell-personal-dictionary nil 0)))
 #+end_src

 #+RESULTS:
 : ispell

