config_old1.org
** Dired
 #+begin_src emacs-lisp :lexical no
   (use-package dirvish
     :init
     (dirvish-override-dired-mode)
     :demand t
     :custom
     (dirvish-quick-access-entries ; It's a custom option, `setq' won't work
      '(("h" "~/"                          "Home")
        ("d" "~/Downloads/"                "Downloads")
        ("m" "/mnt/"                       "Drives")))
     :config
     ;; (dirvish-peek-mode) ; Preview files in minibuffer
     ;; (dirvish-side-follow-mode) ; similar to `treemacs-follow-mode'
     (setq dirvish-mode-line-format
           '(:left (sort symlink) :right (omit yank index)))
     (setq dirvish-hide-details-mode nil)
     (setq dirvish-attributes
           '(file-time file-size collapse subtree-state vc-state git-msg)) ;; all-the-icons 
     (setq delete-by-moving-to-trash t)
     (setq dired-listing-switches
           "-l --almost-all --human-readable --group-directories-first --no-group")
     :bind ; Bind `dirvish|dirvish-side|dirvish-dwim' as you see fit
     (
      ;; ("C-c f" . dirvish-fd)
      :map dirvish-mode-map ; Dirvish inherits `dired-mode-map'
      ("a"   . dirvish-quick-access)
      ("f"   . dirvish-file-info-menu)
      ("y"   . dirvish-yank-menu)
      ("N"   . dirvish-narrow)
      ("^"   . dirvish-history-last)
      ("h"   . dirvish-history-jump) ; remapped `describe-mode'
      ("s"   . dirvish-quicksort)    ; remapped `dired-sort-toggle-or-edit'
      ("v"   . dirvish-vc-menu)      ; remapped `dired-view-file'
      ("TAB" . dirvish-subtree-toggle)
      ("M-f" . dirvish-history-go-forward)
      ("M-b" . dirvish-history-go-backward)
      ("M-l" . dirvish-ls-switches-menu)
      ("M-m" . dirvish-mark-menu)
      ("M-t" . dirvish-layout-toggle)
      ("M-s" . dirvish-setup-menu)
      ("M-e" . dirvish-emerge-menu)
      ("M-j" . dirvish-fd-jump)))
   ;; Addtional syntax highlighting for dired
   (use-package diredfl
     :hook
     ((dired-mode . diredfl-mode)
      ;; highlight parent and directory preview as well
      (dirvish-directory-view-mode . diredfl-mode))
     :config
     (set-face-attribute 'diredfl-dir-name nil :bold t))

   ;; (use-package dired-subtree
   ;;   :config
   ;;   (bind-keys :map dired-mode-map
   ;;              ("i" . dired-subtree-insert)
   ;;             (";" . dired-subtree-remove)))

   (use-package all-the-icons-dired
     :config
     (add-hook 'dired-mode-hook 'all-the-icons-dired-mode)
   	)

   ;; '(global-dired-hide-details-mode t)
   (use-package dired
     :ensure nil
     :straight (:type built-in)
     :demand t
     :init
     (setq dired-dwim-target t  ; suggest a target for moving/copying intelligently
           dired-hide-details-hide-symlink-targets nil
           ;; don't prompt to revert, just do it
           dired-auto-revert-buffer #'dired-buffer-stale-p
           ;; Always copy/delete recursively
           dired-recursive-copies  'always
           dired-recursive-deletes 'top
           ;; Ask whether destination dirs should get created when copying/removing files.
           dired-create-destination-dirs 'ask
           ;; Where to store image caches
           ;; image-dired-dir (concat doom-cache-dir "image-dired/")
           ;; image-dired-db-file (concat image-dired-dir "db.el")
           ;; image-dired-gallery-dir (concat image-dired-dir "gallery/")
           ;; image-dired-temp-image-file (concat image-dired-dir "temp-image")
           ;; image-dired-temp-rotate-image-file (concat image-dired-dir "temp-rotate-image")
           ;; Screens are larger nowadays, we can afford slightly larger thumbnails
           image-dired-thumb-size 150)
     :defer t
     :config
     ;; (set-popup-rule! "^\\*image-dired"
     ;;   :slot 20 :size 0.8 :select t :quit nil :ttl 0)
     ;; (set-evil-initial-state! 'image-dired-display-image-mode 'emacs)
     (setq dired-dwim-target t) ; Dired tries to guess the target directory
     (setq dired-recursive-deletes 'always) ; Allow deleting directories recursively
     (setq dired-listing-switches "-alh --group-directories-first") ; Use human-readable file sizes and group directories first
     (setq dired-hide-details-mode t) ; Hide file and directory details by default
     (setq dired-auto-revert-buffer t) ; Automatically refresh Dired buffers when changes are made
     (setq diredp-hide-details-initially-flag nil)
     (define-key dired-mode-map (kbd "RET") 'dired-find-alternate-file) ; Bind Enter to open files
     (define-key dired-mode-map (kbd "^")
   	   (lambda () (interactive) (find-alternate-file ".."))) ; Bind ^ to go up a directory
     (define-key dired-mode-map (kbd "(") 'dired-hide-details-mode) ; Bind ( to toggle file and directory details
     (define-key dired-mode-map (kbd "N") 'dired-create-file) ; Bind N to create a new file
     (define-key dired-mode-map (kbd "n") 'dired-create-directory)) ; Bind n to create a new directory
     ;; Drag-and-drop to `dired`
     ;; (add-hook 'dired-mode-hook 'org-download-enable)
     (use-package dired-rainbow
       :config
       (progn
         (dired-rainbow-define-chmod directory "#6cb2eb" "d.*")
         (dired-rainbow-define html "#eb5286" ("css" "less" "sass" "scss" "htm" "html" "jhtm" "mht" "eml" "mustache" "xhtml"))
         (dired-rainbow-define xml "#f2d024" ("xml" "xsd" "xsl" "xslt" "wsdl" "bib" "json" "msg" "pgn" "rss" "yaml" "yml" "rdata"))
         (dired-rainbow-define document "#9561e2" ("docm" "doc" "docx" "odb" "odt" "pdb" "pdf" "ps" "rtf" "djvu" "epub" "odp" "ppt" "pptx"))
         (dired-rainbow-define markdown "#ffed4a" ("org" "etx" "info" "markdown" "md" "mkd" "nfo" "pod" "rst" "tex" "textfile" "txt"))
         (dired-rainbow-define database "#6574cd" ("xlsx" "xls" "csv" "accdb" "db" "mdb" "sqlite" "nc"))
         (dired-rainbow-define media "#de751f" ("mp3" "mp4" "MP3" "MP4" "avi" "mpeg" "mpg" "flv" "ogg" "mov" "mid" "midi" "wav" "aiff" "flac"))
         (dired-rainbow-define image "#f66d9b" ("tiff" "tif" "cdr" "gif" "ico" "jpeg" "jpg" "png" "psd" "eps" "svg"))
         (dired-rainbow-define log "#c17d11" ("log"))
         (dired-rainbow-define shell "#f6993f" ("awk" "bash" "bat" "sed" "sh" "zsh" "vim"))
         (dired-rainbow-define interpreted "#38c172" ("py" "ipynb" "rb" "pl" "t" "msql" "mysql" "pgsql" "sql" "r" "clj" "cljs" "scala" "js"))
         (dired-rainbow-define compiled "#4dc0b5" ("asm" "cl" "lisp" "el" "c" "h" "c++" "h++" "hpp" "hxx" "m" "cc" "cs" "cp" "cpp" "go" "f" "for" "ftn" "f90" "f95" "f03" "f08" "s" "rs" "hi" "hs" "pyc" ".java"))
         (dired-rainbow-define executable "#8cc4ff" ("exe" "msi"))
         (dired-rainbow-define compressed "#51d88a" ("7z" "zip" "bz2" "tgz" "txz" "gz" "xz" "z" "Z" "jar" "war" "ear" "rar" "sar" "xpi" "apk" "xz" "tar"))
         (dired-rainbow-define packaged "#faad63" ("deb" "rpm" "apk" "jad" "jar" "cab" "pak" "pk3" "vdf" "vpk" "bsp"))
         (dired-rainbow-define encrypted "#ffed4a" ("gpg" "pgp" "asc" "bfe" "enc" "signature" "sig" "p12" "pem"))
         (dired-rainbow-define fonts "#6cb2eb" ("afm" "fon" "fnt" "pfb" "pfm" "ttf" "otf"))
         (dired-rainbow-define partition "#e3342f" ("dmg" "iso" "bin" "nrg" "qcow" "toast" "vcd" "vmdk" "bak"))
         (dired-rainbow-define vc "#0074d9" ("git" "gitignore" "gitattributes" "gitmodules"))
         (dired-rainbow-define-chmod executable-unix "#38c172" "-.*x.*")))
     ;; (use-package dired-open
     ;;   :config
     ;;   ;; Doesn't work as expected!
     ;;   (add-to-list 'dired-open-functions #'dired-open-xdg t))
     (use-package dired-sidebar
       :bind (("C-x C-n" . dired-sidebar-toggle-sidebar))
       :ensure t
       :commands (dired-sidebar-toggle-sidebar)
       ;; :init
       ;; (add-hook 'dired-sidebar-mode-hook
       ;;           (lambda ()
       ;;             (unless (file-remote-p default-directory)
       ;;               (auto-revert-mode))))
       :config
       (push 'toggle-window-split dired-sidebar-toggle-hidden-commands)
       (push 'rotate-windows dired-sidebar-toggle-hidden-commands)
       (setq dired-sidebar-subtree-line-prefix "__")
       (setq dired-sidebar-theme 'vscode)
       (setq dired-sidebar-use-term-integration t)
       ;;(setq dired-sidebar-use-custom-font t))
     (use-package dired-single))

   ;; Sort dirs first
   (require 'ls-lisp)
   (setq ls-lisp-dirs-first t)
   (setq ls-lisp-use-insert-directory-program t)

   (provide 'dired-setting)
 #+end_src

 #+RESULTS:
 : dired-setting

