config_old1.org
** Formatter
 #+begin_src emacs-lisp :lexical no
   (use-package format-all
     :preface
     (defun ian/format-code ()
       "Auto-format whole buffer."
       (interactive)
       (if (derived-mode-p 'prolog-mode)
           (prolog-indent-buffer)
         (format-all-buffer)))
     :config
     (global-set-key (kbd "M-F") 'ian/format-code)
     (global-set-key (kbd "C-c C-f") 'format-all-buffer)
     (add-hook 'prog-mode-hook 'format-all-ensure-formatter))

   (global-set-key (kbd "\C-c C-f") 'format-all-buffer)
 #+end_src

** Dashboard
#+begin_src emacs-lisp
  (use-package dashboard
    :after all-the-icons
    :ensure t
    :defer nil
    :config
    (setq dashboard-banner-logo-title "Welcome back, Darling!"
          dashboard-startup-banner "~/.emacs.d/images/Emacs-logo.svg"
          dashboard-center-content    t
          dashboard-show-shortcuts    t
          dashboard-set-navigator     nil
          dashboard-set-heading-icons t
          initial-buffer-choice       (lambda () (get-buffer "*dashboard*"))
          dashboard-set-file-icons    t)
    (setq dashboard-items '((recents  . 8)
                            ;; (agenda   . 5)
                            (projects . 7)))
    (dashboard-setup-startup-hook)
    :init
    (add-hook 'after-init-hook 'dashboard-refresh-buffer))

#+end_src

#+RESULTS:
: t

* Git
** Magit
#+begin_src example
  (use-package magit
    :commands (magit-status magit-ediff-show-working-tree)
    :bind ("C-c C-d" . magit-ediff-show-working-tree)
    :custom (magit-display-buffer-function 'magit-display-buffer-same-window-except-diff-v1))
#+end_src

** Magit TODO's
#+begin_src example
  (use-package magit-todos
    :commands (magit-todos-mode)
    :hook (magit-mode . magit-todos-mode)
    :config
    (setq magit-todos-recursive t
          magit-todos-depth 4
          magit-todos-exclude-globs '("*Pods*" ".git/" "*elpa*" "*var/lsp/*" "node_modules/" "target/"))
    (custom-set-variable
     '(magit-todos-keywords (list "TODO" "FIXME" "BUGFIX" "HACK"))))
#+end_src

** Blamer
#+begin_src example
  (use-package blamer
    :hook (prog-mode . blamer-mode)
    :custom
    (blamer-idle-time 0.3)
    (blamer-min-offset 70)
    :custom-face
    (blamer-face ((t :foreground "#7a88cf"
                     :background nil
                     :height 140
                     :italic t)))
    :config
    (setq blamer-view 'overlay
          blamer-type 'posframe-popup
          blamer-max-commit-message-length 70
          blamer-force-truncate-long-line nil
          blamer-author-formatter " ✎ [%s] - "
          blamer-commit-formatter "● %s ● ")

    (defun blamer-callback-show-commit-diff (commit-info)
      (interactive)
      (let ((commit-hash (plist-get commit-info :commit-hash)))
        (when commit-hash
          (magit-show-commit commit-hash))))

    (defun blamer-callback-open-remote (commit-info)
      (interactive)
      (let ((commit-hash (plist-get commit-info :commit-hash)))
        (when commit-hash
          (message commit-hash)
          (forge-browse-commit commit-hash))))

    (setq blamer-bindings '(("<mouse-3>" . blamer-callback-open-remote)
                            ("<mouse-1>" . blamer-callback-show-commit-diff)))
    (global-blamer-mode 1))
#+end_src

** Git gutter
#+begin_src emacs-lisp
  (use-package git-gutter
    :hook (prog-mode . git-gutter-mode)
    :defer nil
    :config
    (setq git-gutter:update-interval 0.02))

  (use-package git-gutter-fringe
    :defer nil
    :config
    (define-fringe-bitmap 'git-gutter-fr:added [224] nil nil '(center repeated))
    (define-fringe-bitmap 'git-gutter-fr:modified [224] nil nil '(center repeated))
    (define-fringe-bitmap 'git-gutter-fr:deleted [128 192 224 240] nil nil 'bottom))
#+end_src

* Flycheck
** Base flycheck settings
#+begin_src emacs-lisp
    (use-package flycheck
      :hook (prog-mode . flycheck-mode)
      :diminish
      :custom
      (flycheck-indication-mode 'left-fringe)
      (flycheck-display-errors-delay 0.5)
      (flycheck-check-syntax-automatically '(save idle-change))
      (flycheck-idle-change-delay 0.5)
      ;; :config
      ;; (add-hook 'LaTeX-mode-hook 'flyspell-mode)
  ;;     (add-hook 'org-mode-hook 'flyspell-mode)
  )

    (use-package flycheck-inline
      :hook (flycheck-mode . turn-on-flycheck-inline))
#+end_src
** Flycheck rust
#+begin_src emacs-lisp
    (use-package flycheck-rust
      :config
      (with-eval-after-load 'rust-mode
        (add-hook 'flycheck-mode-hook 'flycheck-rust-setup)))
#+end_src
* LSP
** Base LSP settings
#+begin_src emacs-lisp :lexical no
  (use-package lsp-mode
    :init
    ;; set prefix for lsp-command-keymap (few alternatives - "C-l", "C-c l")
    (setq lsp-keymap-prefix "C-l")
    :straight t
    :hook ((go-mode         . lsp)
           (rust-mode       . lsp)
  				 (emacs-lisp-mode . lsp)
  				 (lisp            . lsp)
           (js-mode         . lsp)
  				 (solidity-mode   . lsp)
           (typescript-mode . lsp)
           ;; (LaTeX-mode      . lsp)
           (lsp-mode        . lsp-enable-which-key-integration))
    :custom
    ;; what to use when checking on-save. "check" is default, I prefer clippy
    (lsp-rust-analyzer-cargo-watch-command "clippy")
    (lsp-eldoc-render-all t)
    (lsp-idle-delay 0.4)
    ;; enable / disable the hints as you prefer:
    (lsp-inlay-hint-enable t)
    ;; These are optional configurations. See https://emacs-lsp.github.io/lsp-mode/page/lsp-rust-analyzer/#lsp-rust-analyzer-display-chaining-hints for a full list
    (lsp-rust-analyzer-display-lifetime-elision-hints-enable "skip_trivial")
    (lsp-rust-analyzer-display-chaining-hints t)
    (lsp-rust-analyzer-display-lifetime-elision-hints-use-parameter-names nil)
    (lsp-rust-analyzer-display-closure-return-type-hints t)
    (lsp-rust-analyzer-display-parameter-hints nil)
    (lsp-rust-analyzer-display-reborrow-hints nil)
    :config
    (delete 'lsp-terraform lsp-client-packages)
    (add-hook 'lsp-mode-hook 'lsp-ui-mode))

  ;; Symbol highlighting
  (setq lsp-enable-symbol-highlighting nil)

  ;; Need for LSP
  ;; (use-package sideline
  ;;   :init
  ;;   (setq sideline-backends-skip-current-line t  ; don't display on current line
  ;;         sideline-order-left 'down              ; or 'up
  ;;         sideline-order-right 'up               ; or 'down
  ;;         sideline-format-left "%s   "           ; format for left aligment
  ;;         sideline-format-right "   %s"          ; format for right aligment
  ;;         sideline-priority 100                  ; overlays' priority
  ;;         sideline-display-backend-name t))      ; display the backend name

  ;; (use-package sideline-flycheck
  ;; :hook (flycheck-mode . sideline-flycheck-setup))

  ;; (setq tab-always-indent 'complete)
  ;; (setq completion-cycle-threshold 3)
#+end_src

#+RESULTS:

** LSP UI
#+begin_src emacs-lisp
  ;; (use-package lsp-ui
  ;;   :ensure
  ;;   :commands lsp-ui-mode
  ;;   :custom
  ;;   (lsp-ui-peek-always-show t)
  ;;   (lsp-ui-sideline-show-hover t)
  ;;   (lsp-ui-doc-enable nil))

  (use-package lsp-ui
    :hook (lsp-mode . lsp-ui-mode)
    :commands lsp-ui-mode
    :config
    (setq
     lsp-inlay-hints-mode t
     lsp-ui-doc-enable t
     lsp-ui-doc-max-height 8
     lsp-ui-doc-max-width 130         ; 150 (default) is too wide
     lsp-ui-doc-delay 0.2           ; 0.2 (default) is too naggy
     lsp-ui-doc-show-with-mouse t  ; don't disappear on mouseover
     ;; lsp-ui-doc-show-with-cursor t
     lsp-ui-doc-border (face-foreground 'default)
     lsp-ui-doc-position 'at-point
     lsp-ui-doc-include-signature t
     lsp-ui-doc-header t))
  ;; lsp-ui-sideline-delay 0.02
  ;; lsp-ui-sideline-ignore-duplicate t
  ;; lsp-ui-sideline-show-code-actions t
  ;; lsp-ui-sideline-update-mode 'line
  ;; lsp-ui-sideline-show-diagnostics t
  ;; lsp-ui-sideline-show-hover t
  ;; lsp-ui-sideline-actions-icon lsp-ui-sideline-actions-icon-default
  ;; lsp-ui-sideline-mode nil
#+end_src

#+RESULTS:
| lsp-ui-mode | lsp-enable-which-key-integration |

** Tree sitter (disabled)
#+begin_src example :lexical no
  (use-package tree-sitter
    :ensure t
    :config
    ;; activate tree-sitter on any buffer containing code for which it has a parser available
    (global-tree-sitter-mode)
    ;; you can easily see the difference tree-sitter-hl-mode makes for python, ts or tsx
    ;; by switching on and off
    (add-hook 'tree-sitter-after-on-hook #'tree-sitter-hl-mode))

  (use-package tree-sitter-langs
    :ensure t
    :after tree-sitter)
#+end_src

#+RESULTS:
: tree-sitter-langs

** Helm LSP
#+begin_src emacs-lisp
  (use-package helm-lsp
    :commands helm-lsp-workspace-symbol)
#+end_src

** Languages
