config_old1.el

(use-package format-all
  :preface
  (defun ian/format-code ()
    "Auto-format whole buffer."
    (interactive)
    (if (derived-mode-p 'prolog-mode)
        (prolog-indent-buffer)
      (format-all-buffer)))
  :config
  (global-set-key (kbd "M-F") 'ian/format-code)
  (global-set-key (kbd "C-c C-f") 'format-all-buffer)
  (add-hook 'prog-mode-hook 'format-all-ensure-formatter))

(global-set-key (kbd "\C-c C-f") 'format-all-buffer)

(use-package dashboard
  :after all-the-icons
  :ensure t
  :defer nil
  :config
  (setq dashboard-banner-logo-title "Welcome back, Darling!"
        dashboard-startup-banner "~/.emacs.d/images/Emacs-logo.svg"
        dashboard-center-content    t
        dashboard-show-shortcuts    t
        dashboard-set-navigator     nil
        dashboard-set-heading-icons t
        initial-buffer-choice       (lambda () (get-buffer "*dashboard*"))
        dashboard-set-file-icons    t)
  (setq dashboard-items '((recents  . 8)
                          ;; (agenda   . 5)
                          (projects . 7)))
  (dashboard-setup-startup-hook)
  :init
  (add-hook 'after-init-hook 'dashboard-refresh-buffer))

(use-package git-gutter
  :hook (prog-mode . git-gutter-mode)
  :defer nil
  :config
  (setq git-gutter:update-interval 0.02))

(use-package git-gutter-fringe
  :defer nil
  :config
  (define-fringe-bitmap 'git-gutter-fr:added [224] nil nil '(center repeated))
  (define-fringe-bitmap 'git-gutter-fr:modified [224] nil nil '(center repeated))
  (define-fringe-bitmap 'git-gutter-fr:deleted [128 192 224 240] nil nil 'bottom))

(use-package flycheck
    :hook (prog-mode . flycheck-mode)
    :diminish
    :custom
    (flycheck-indication-mode 'left-fringe)
    (flycheck-display-errors-delay 0.5)
    (flycheck-check-syntax-automatically '(save idle-change))
    (flycheck-idle-change-delay 0.5)
    ;; :config
    ;; (add-hook 'LaTeX-mode-hook 'flyspell-mode)
;;     (add-hook 'org-mode-hook 'flyspell-mode)
)

  (use-package flycheck-inline
    :hook (flycheck-mode . turn-on-flycheck-inline))

(use-package flycheck-rust
  :config
  (with-eval-after-load 'rust-mode
    (add-hook 'flycheck-mode-hook 'flycheck-rust-setup)))

(use-package lsp-mode
  :init
  ;; set prefix for lsp-command-keymap (few alternatives - "C-l", "C-c l")
  (setq lsp-keymap-prefix "C-l")
  :straight t
  :hook ((go-mode         . lsp)
         (rust-mode       . lsp)
  			       (emacs-lisp-mode . lsp)
  			       (lisp            . lsp)
         (js-mode         . lsp)
  			       (solidity-mode   . lsp)
         (typescript-mode . lsp)
         ;; (LaTeX-mode      . lsp)
         (lsp-mode        . lsp-enable-which-key-integration))
  :custom
  ;; what to use when checking on-save. "check" is default, I prefer clippy
  (lsp-rust-analyzer-cargo-watch-command "clippy")
  (lsp-eldoc-render-all t)
  (lsp-idle-delay 0.4)
  ;; enable / disable the hints as you prefer:
  (lsp-inlay-hint-enable t)
  ;; These are optional configurations. See https://emacs-lsp.github.io/lsp-mode/page/lsp-rust-analyzer/#lsp-rust-analyzer-display-chaining-hints for a full list
  (lsp-rust-analyzer-display-lifetime-elision-hints-enable "skip_trivial")
  (lsp-rust-analyzer-display-chaining-hints t)
  (lsp-rust-analyzer-display-lifetime-elision-hints-use-parameter-names nil)
  (lsp-rust-analyzer-display-closure-return-type-hints t)
  (lsp-rust-analyzer-display-parameter-hints nil)
  (lsp-rust-analyzer-display-reborrow-hints nil)
  :config
  (delete 'lsp-terraform lsp-client-packages)
  (add-hook 'lsp-mode-hook 'lsp-ui-mode))

;; Symbol highlighting
(setq lsp-enable-symbol-highlighting nil)

;; Need for LSP
;; (use-package sideline
;;   :init
;;   (setq sideline-backends-skip-current-line t  ; don't display on current line
;;         sideline-order-left 'down              ; or 'up
;;         sideline-order-right 'up               ; or 'down
;;         sideline-format-left "%s   "           ; format for left aligment
;;         sideline-format-right "   %s"          ; format for right aligment
;;         sideline-priority 100                  ; overlays' priority
;;         sideline-display-backend-name t))      ; display the backend name

;; (use-package sideline-flycheck
;; :hook (flycheck-mode . sideline-flycheck-setup))

;; (setq tab-always-indent 'complete)
;; (setq completion-cycle-threshold 3)

;; (use-package lsp-ui
;;   :ensure
;;   :commands lsp-ui-mode
;;   :custom
;;   (lsp-ui-peek-always-show t)
;;   (lsp-ui-sideline-show-hover t)
;;   (lsp-ui-doc-enable nil))

(use-package lsp-ui
  :hook (lsp-mode . lsp-ui-mode)
  :commands lsp-ui-mode
  :config
  (setq
   lsp-inlay-hints-mode t
   lsp-ui-doc-enable t
   lsp-ui-doc-max-height 8
   lsp-ui-doc-max-width 130         ; 150 (default) is too wide
   lsp-ui-doc-delay 0.2           ; 0.2 (default) is too naggy
   lsp-ui-doc-show-with-mouse t  ; don't disappear on mouseover
   ;; lsp-ui-doc-show-with-cursor t
   lsp-ui-doc-border (face-foreground 'default)
   lsp-ui-doc-position 'at-point
   lsp-ui-doc-include-signature t
   lsp-ui-doc-header t))
;; lsp-ui-sideline-delay 0.02
;; lsp-ui-sideline-ignore-duplicate t
;; lsp-ui-sideline-show-code-actions t
;; lsp-ui-sideline-update-mode 'line
;; lsp-ui-sideline-show-diagnostics t
;; lsp-ui-sideline-show-hover t
;; lsp-ui-sideline-actions-icon lsp-ui-sideline-actions-icon-default
;; lsp-ui-sideline-mode nil

(use-package helm-lsp
  :commands helm-lsp-workspace-symbol)
