config_old1.org
*** JavaScript / TypeScript
#+begin_src emacs-lisp
  (use-package import-js)
  ;; sudo npm install import-js -g

  (use-package typescript-mode
    :mode (("\\.ts\\'" . typescript-mode)
           ("\\.tsx\\'" . typescript-mode))
    :config
    ;; we choose this instead of tsx-mode so that eglot can automatically figure out language for server
    ;; see https://github.com/joaotavora/eglot/issues/624 and https://github.com/joaotavora/eglot#handling-quirky-servers
    (define-derived-mode typescriptreact-mode typescript-mode
      "TypeScript TSX"))

  ;; https://github.com/orzechowskid/tsi.el/
  ;; great tree-sitter-based indentation for typescript/tsx, css, json
  ;; (use-package tsi
  ;;   :after tree-sitter
  ;;   :straight (tsi :type git :host github :repo "orzechowskid/tsi.el")
  ;;   ;; define autoload definitions which when actually invoked will cause package to be loaded
  ;;   :commands (tsi-typescript-mode tsi-json-mode tsi-css-mode)
  ;;   :init
  ;;   (add-hook 'typescript-mode-hook (lambda () (tsi-typescript-mode 1)))
  ;;   (add-hook 'json-mode-hook (lambda () (tsi-json-mode 1)))
  ;;   (add-hook 'css-mode-hook (lambda () (tsi-css-mode 1)))
  ;;   (add-hook 'scss-mode-hook (lambda () (tsi-scss-mode 1))))

  ;; auto-format different source code files extremely intelligently
  ;; https://github.com/radian-software/apheleia
  ;; (use-package apheleia
  ;;   :ensure t
  ;;   :config
  ;;   (apheleia-global-mode +1))

  (use-package tide
    :after (company flycheck)
    :hook ((typescript-mode . tide-setup)
           (tsx-ts-mode . tide-setup)
           (typescript-mode . tide-hl-identifier-mode)
           (before-save . tide-format-before-save)))
  (defun setup-tide-mode ()
    (interactive)
    (tide-setup)
    (flycheck-mode +1)
    (setq flycheck-check-syntax-automatically '(save mode-enabled))
    (eldoc-mode +1)
    (tide-hl-identifier-mode +1)
    (company-mode +1))
  (setq tide-format-options '(:tabSize 2 :indentSize 2 ))

  ;; TSX with treesitter
  (add-hook 'tsx-ts-mode-hook 'setup-tide-mode)
  (add-hook 'js2-mode-hook 'setup-tide-mode)

  ;; formats the buffer before saving
  (add-hook 'before-save-hook 'tide-format-before-save)
  (add-hook 'typescript-mode-hook 'setup-tide-mode)
#+end_src

#+RESULTS:
| setup-tide-mode | tide-hl-identifier-mode | tide-setup | evil-collection-typescript-mode-set-evil-shift-width | (lambda nil (tsi-typescript-mode 1)) | lsp |
*** JSON
#+begin_src emacs-lisp :lexical no
  (use-package json-mode
    :defer 20
    :custom
    (json-reformat:indent-width 2)
    :mode (("\\.bowerrc$"     . json-mode)
	 ("\\.jshintrc$"    . json-mode)
	 ("\\.json_schema$" . json-mode)
	 ("\\.json\\'" . json-mode))
    :bind (:package json-mode-map
		  :map json-mode-map
		  ("C-c <tab>" . json-mode-beautify)))
#+end_src
*** Rust
#+begin_src emacs-lisp
  (use-package rust-playground)

  (use-package rust-mode
    :if (executable-find "rustc"))

  (use-package cargo
    :if (executable-find "cargo")
    :after rust-mode
    :bind (:map cargo-minor-mode-map
                ("C-c C-t" . cargo-process-test)
                ("C-c C-b" . cargo-process-build)
                ("C-c C-c" . cargo-process-run))
    :config
    (add-hook 'rust-mode-hook 'cargo-minor-mode))

  (use-package rustic
    :ensure
    :bind (:map rustic-mode-map
                ("M-j" . lsp-ui-imenu)
                ("M-?" . lsp-find-references)
                ("C-c C-c l" . flycheck-list-errors)
                ("C-c C-c a" . lsp-execute-code-action)
                ("C-c C-c r" . lsp-rename)
                ("C-c C-c q" . lsp-workspace-restart)
                ("C-c C-c Q" . lsp-workspace-shutdown)
                ("C-c C-c s" . lsp-rust-analyzer-status))
    :config
    ;; uncomment for less flashiness
    ;; (setq lsp-eldoc-hook nil)
    ;; (setq lsp-enable-symbol-highlighting nil)
    ;; (setq lsp-signature-auto-activate nil)

    ;; comment to disable rustfmt on save
    (setq rustic-format-on-save t)
    (add-hook 'rustic-mode-hook 'rk/rustic-mode-hook))

  (defun rk/rustic-mode-hook ()
    ;; so that run C-c C-c C-r works without having to confirm, but don't try to
    ;; save rust buffers that are not file visiting. Once
    ;; https://github.com/brotzeit/rustic/issues/253 has been resolved this should
    ;; no longer be necessary.
    (when buffer-file-name
      (setq-local buffer-save-without-query t))
    (add-hook 'before-save-hook 'lsp-format-buffer nil t))
#+end_src

#+RESULTS:
: rk/rustic-mode-hook

*** Solidity
#+begin_src emacs-lisp
  (use-package solidity-mode)
  (use-package solidity-flycheck)
  (use-package company-solidity)
#+end_src

*** Go
#+begin_src emacs-lisp
  (use-package go-mode)
  ;; (add-hook 'go-mode-hook 'lsp-go-install-save-hooks)
#+end_src

#+RESULTS:
: go-mode

** Yasnippet
#+begin_src emacs-lisp :lexical no
  (use-package yasnippet
    :ensure
    :config
    (yas-reload-all)
    (add-hook 'prog-mode-hook 'yas-minor-mode)
    (add-hook 'text-mode-hook 'yas-minor-mode))
#+end_src

#+RESULTS:
: t

** Company
*** Base company settings
#+begin_src emacs-lisp
  (use-package company
    :init
    (setq company-minimum-prefix-length 2
          company-tooltip-limit 14
          company-tooltip-align-annotations t ; aligns annotation to the right hand side
          company-require-match 'never
          company-global-modes
          '(not erc-mode
                circe-mode
                message-mode
                help-mode
                gud-mode
                vterm-mode)
          company-frontends
          '(company-pseudo-tooltip-frontend  ; always show candidates in overlay tooltip
            company-echo-metadata-frontend)  ; show selected candidate docs in echo area

          ;; Buffer-local backends will be computed when loading a major mode, so
          ;; only specify a global default here.
          company-backends '(company-capf)

          ;; These auto-complete the current selection when
          ;; `company-auto-commit-chars' is typed. This is too magical. We
          ;; already have the much more explicit RET and TAB.
          company-auto-commit nil

          ;; Only search the current buffer for `company-dabbrev' (a backend that
          ;; suggests text your open buffers). This prevents Company from causing
          ;; lag once you have a lot of buffers open.
          company-dabbrev-other-buffers nil
          ;; Make `company-dabbrev' fully case-sensitive, to improve UX with
          ;; domain-specific words with particular casing.
          company-dabbrev-ignore-case nil
          company-dabbrev-downcase nil)
    :custom
    (company-idle-delay 0.2) ;; how long to wait until popup
    ;; (company-begin-commands nil) ;; uncomment to disable popup
    :bind
    (:map company-active-map
  	("C-n". company-select-next)
  	("C-p". company-select-previous)
  	("M-<". company-select-first)
  	("M->". company-select-last)))
#+end_src

#+RESULTS:
: company-select-last

*** Company box
#+begin_src emacs-lisp
  (use-package company-box
    :hook (company-mode . company-box-mode)
    :config
    (setq company-box-show-single-candidate t
          company-box-backends-colors nil
          company-box-tooltip-limit 30))
#+end_src

*** Company org block (disabled)
#+begin_src example
  (use-package company-org-block
    :custom
    (company-org-block-edit-style 'auto) ;; 'auto, 'prompt, or 'inline
    :hook ((org-mode . (lambda ()
                         (setq-local company-backends '(company-org-block))
                         (company-mode +1)))))
#+end_src

*** Company AUCTeX (disabled)
#+begin_src example
  (use-package company-auctex
    :after (latex)
    :config
    ;; Set up default LaTeX preview configuration
    (setq org-format-latex-options (plist-put org-format-latex-options :scale 2))
    (setq org-latex-create-formula-image-program 'imagemagick)
    (setq org-preview-latex-default-process 'imagemagick) ; or 'dvisvgm
    (setq org-preview-latex-process-alist
          '((imagemagick :programs ("latex" "convert")
                         :description "imagemagick"
                         :message "You need to install the programs: latex and imagemagick."
                         :image-input-type "pdf"
                         :image-output-type "png"
                         :image-size-adjust (1.0 . 1.0)
                         :latex-compiler ("pdflatex -interaction nonstopmode -output-directory %o %f")
                         :image-converter ("convert -density %D -trim -antialias %f -quality 100 %O"))
            (dvisvgm :programs ("latex" "dvisvgm")
                     :description "dvisvgm"
                     :message "You need to install the programs: latex and dvisvgm."
                     :image-input-type "xdv"
                     :image-output-type "svg"
                     :image-size-adjust (1.7 . 1.5)
                     :latex-compiler ("xelatex -no-pdf -interaction nonstopmode -output-directory %o %f")
                     :image-converter ("dvisvgm %f -n -b min -c %S -o %O"))))
    ;; Enable inline LaTeX previews in org-mode
    (add-hook 'org-mode-hook 'org-toggle-latex-fragment)
    ;; Display images in org-mode buffers
    (setq org-image-actual-width nil) ; adjust to your liking
    (setq org-startup-with-inline-images t)
    (use-package ac-math))
  (company-auctex-init)
#+end_src

#+RESULTS:
| (company-auctex-macros company-auctex-symbols company-auctex-environments) | company-auctex-bibs | company-auctex-labels | company-org-block |

* Useless
** Flycheck ledger (disabled)
#+begin_src example
  (use-package flycheck-ledger)
#+end_src
