config_old1.org
** Flyspell (disabled)
#+begin_src example :lexical no
  (use-package flyspell
    :hook (org-mode . flyspell-mode)
    :bind (:map flyspell-mode-map
                ("C-;"        . nil)
                ("C-,"        . nil)
                ("C-."        . nil)
                ("M-TAB"      . nil)
                ("C-x M-$"    . flyspell-buffer)
                ("C-<f7>"     . flyspell-auto-correct-word)
                ("C-<f12>"    . flyspell-auto-correct-previous-word))
    :init (progn (dolist (hook '(org-mode-hook text-mode-hook message-mode-hook))
                   (add-hook hook 'turn-on-flyspell)))
    ;; (add-hook 'prog-mode-hook 'flyspell-prog-mode)
    :delight " ⓢ")
#+end_src
** Games (disabled)
#+begin_src example
  (use-package sudoku)
  (use-package chess)
#+end_src
** Emojify (disabled)
#+begin_src example
  (use-package emojify
    :config
    (when (member "Segoe UI Emoji" (font-family-list))
      (set-fontset-font
       t 'symbol (font-spec :family "Segoe UI Emoji") nil 'prepend))
    (setq emojify-display-style 'unicode)
    (setq emojify-emoji-styles '(unicode))
    (bind-key* (kbd "C-c e") #'emojify-insert-emoji)) ; override binding in any mode

#+end_src

** ox-reveal (disabled)
#+begin_src example :lexical no
    (use-package ox-reveal)
  ;;     :config
      ;; (setq org-reveal-root "file:///home/berezhnev/Nextcloud/Org/Presentations/reveal.js")
  
#+end_src

#+RESULTS:
: ox-reveal

** org-tree-slide (disabled)
#+begin_src example :lexical no
  (use-package org-tree-slide)
#+end_src

#+RESULTS:
: org-tree-slide

** org-ai (disabled)
#+begin_src example :lexical no
  (use-package org-ai
    :ensure t
    :commands (org-ai-mode
               org-ai-global-mode)
    :init
    (add-hook 'org-mode-hook #'org-ai-mode) ; enable org-ai in org-mode
    (org-ai-global-mode) ; installs global keybindings on C-c M-a
    :config
    ;; (setq org-ai-default-chat-model "gpt-4") ; if you are on the gpt-4 beta:
    (setq org-ai-openai-api-token "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")
    (org-ai-install-yasnippets)) ; if you are using yasnippet and want `ai` snippets

#+end_src

#+RESULTS:
: t
** todo-projectile (disabled)
#+begin_src example :lexical no
  (add-to-list 'load-path "~/.emacs.d/local-packages/todo-projectile/")
  ;; (require 'todo-projectile)
#+end_src

#+RESULTS:
| ~/.emacs.d/local-packages/todo-projectile/ | /home/berezhnev/.emacs.d/straight/build/projectile | /home/berezhnev/.emacs.d/straight/build/spinner | /home/berezhnev/.emacs.d/straight/build/llm | /home/berezhnev/.emacs.d/straight/build/ellama | /home/berezhnev/.emacs.d/straight/build/org-ai | /home/berezhnev/.emacs.d/straight/build/request-deferred | /home/berezhnev/.emacs.d/straight/build/db | /home/berezhnev/.emacs.d/straight/build/fakir | /home/berezhnev/.emacs.d/straight/build/kv | /home/berezhnev/.emacs.d/straight/build/creole | /home/berezhnev/.emacs.d/straight/build/noflet | /home/berezhnev/.emacs.d/straight/build/web | /home/berezhnev/.emacs.d/straight/build/elnode | /home/berezhnev/.emacs.d/straight/build/aio | /home/berezhnev/.emacs.d/straight/build/org-gcal | /home/berezhnev/.emacs.d/straight/build/org-noter/modules | /home/berezhnev/.emacs.d/straight/build/org-noter | /home/berezhnev/.emacs.d/straight/build/deft | /home/berezhnev/.emacs.d/straight/build/org-roam-timestamps | /home/berezhnev/.emacs.d/straight/build/org-drill | /home/berezhnev/.emacs.d/straight/build/wgrep | /home/berezhnev/.emacs.d/straight/build/rg | ~/.emacs.d/local-packages/nursery/lisp | /home/berezhnev/.emacs.d/straight/build/websocket | /home/berezhnev/.emacs.d/straight/build/simple-httpd | /home/berezhnev/.emacs.d/straight/build/org-roam-ui | /home/berezhnev/.emacs.d/straight/build/magit-section | /home/berezhnev/.emacs.d/straight/build/emacsql | /home/berezhnev/.emacs.d/straight/build/org-roam | /home/berezhnev/.emacs.d/straight/build/org-clock-budget | /home/berezhnev/.emacs.d/straight/build/org-pomodoro | /home/berezhnev/.emacs.d/straight/build/persist | /home/berezhnev/.emacs.d/straight/build/svg | /home/berezhnev/.emacs.d/straight/build/org-timeblock | /home/berezhnev/.emacs.d/straight/build/anki-editor | /home/berezhnev/.emacs.d/straight/build/promise | /home/berezhnev/.emacs.d/straight/build/request | /home/berezhnev/.emacs.d/straight/build/org-anki | /home/berezhnev/.emacs.d/straight/build/transient | /home/berezhnev/.emacs.d/straight/build/peg | /home/berezhnev/.emacs.d/straight/build/ov | /home/berezhnev/.emacs.d/straight/build/ts | /home/berezhnev/.emacs.d/straight/build/org-super-agenda | /home/berezhnev/.emacs.d/straight/build/map | /home/berezhnev/.emacs.d/straight/build/org-ql | /home/berezhnev/.emacs.d/straight/build/helm-org | /home/berezhnev/.emacs.d/straight/build/popup | /home/berezhnev/.emacs.d/straight/build/wfnames | /home/berezhnev/.emacs.d/straight/build/helm-core | /home/berezhnev/.emacs.d/straight/build/helm | /home/berezhnev/.emacs.d/straight/build/enlive | /home/berezhnev/.emacs.d/straight/build/org-books | /home/berezhnev/.emacs.d/straight/build/org-cliplink | /home/berezhnev/.emacs.d/straight/build/log4e | /home/berezhnev/.emacs.d/straight/build/gntp | /home/berezhnev/.emacs.d/straight/build/alert | /home/berezhnev/.emacs.d/straight/build/deferred | /home/berezhnev/.emacs.d/straight/build/sound-wav | /home/berezhnev/.emacs.d/straight/build/org-notifications | /home/berezhnev/.emacs.d/straight/build/org-reverse-datetree | /home/berezhnev/.emacs.d/straight/build/toc-org | /home/berezhnev/.emacs.d/straight/build/ob-sql-mode | /home/berezhnev/.emacs.d/straight/build/solidity-mode | /home/berezhnev/.emacs.d/straight/build/ob-solidity | /home/berezhnev/.emacs.d/straight/build/ob-go | /home/berezhnev/.emacs.d/straight/build/ob-rust | /home/berezhnev/.emacs.d/straight/build/ob-http | /home/berezhnev/.emacs.d/straight/build/ob-typescript | /home/berezhnev/.emacs.d/straight/build/tsc | /home/berezhnev/.emacs.d/straight/build/ivy | /home/berezhnev/.emacs.d/straight/build/swiper | /home/berezhnev/.emacs.d/straight/build/counsel-jq | /home/berezhnev/.emacs.d/straight/build/org-analyzer | /home/berezhnev/.emacs.d/straight/build/async | /home/berezhnev/.emacs.d/straight/build/org-download | /home/berezhnev/.emacs.d/straight/build/org-transclusion | /home/berezhnev/.emacs.d/straight/build/org-appear | /home/berezhnev/.emacs.d/straight/build/org-modern | /home/berezhnev/.emacs.d/straight/build/org-habit-stats | /home/berezhnev/.emacs.d/straight/build/olivetti | /home/berezhnev/.emacs.d/straight/build/parent-mode | /home/berezhnev/.emacs.d/straight/build/highlight-numbers | /home/berezhnev/.emacs.d/straight/build/reverse-im | /home/berezhnev/.emacs.d/straight/build/ht | /home/berezhnev/.emacs.d/straight/build/emojify | /home/berezhnev/.emacs.d/straight/build/f | /home/berezhnev/.emacs.d/straight/build/s | /home/berezhnev/.emacs.d/straight/build/shrink-path | /home/berezhnev/.emacs.d/straight/build/nerd-icons | /home/berezhnev/.emacs.d/straight/build/compat | /home/berezhnev/.emacs.d/straight/build/doom-modeline | /home/berezhnev/.emacs.d/straight/build/auto-dark | /home/berezhnev/.emacs.d/straight/build/theme-changer | /home/berezhnev/.emacs.d/straight/build/ef-themes | /home/berezhnev/.emacs.d/straight/build/dash | /home/berezhnev/.emacs.d/straight/build/autothemer | /home/berezhnev/.emacs.d/straight/build/gruvbox-theme | /home/berezhnev/.emacs.d/straight/build/doom-themes | /home/berezhnev/.emacs.d/straight/build/ligature | /home/berezhnev/.emacs.d/straight/build/all-the-icons | /home/berezhnev/.emacs.d/straight/build/which-key | /home/berezhnev/.emacs.d/straight/build/rainbow-delimiters | /home/berezhnev/.emacs.d/straight/build/russian-holidays | /home/berezhnev/.emacs.d/straight/build/sudo-save | /home/berezhnev/.emacs.d/straight/build/ledger-mode | /home/berezhnev/.emacs.d/straight/build/annalist | /home/berezhnev/.emacs.d/straight/build/evil-collection | /home/berezhnev/.emacs.d/straight/build/general | /home/berezhnev/.emacs.d/straight/build/goto-chg | /home/berezhnev/.emacs.d/straight/build/evil | /home/berezhnev/.emacs.d/straight/build/zygospore | /home/berezhnev/.emacs.d/straight/build/xref | /home/berezhnev/.emacs.d/straight/build/project | /home/berezhnev/.emacs.d/straight/build/multi-vterm | /home/berezhnev/.emacs.d/straight/build/vterm | /home/berezhnev/.emacs.d/straight/build/seq | /home/berezhnev/.emacs.d/straight/build/bug-hunter | /home/berezhnev/.emacs.d/straight/build/key-chord | /home/berezhnev/.emacs.d/straight/build/bind-chord | /home/berezhnev/.emacs.d/straight/build/use-package-chords | /home/berezhnev/.emacs.d/straight/build/org | /home/berezhnev/.emacs.d/straight/build/bind-key | /home/berezhnev/.emacs.d/straight/build/use-package | /home/berezhnev/.emacs.d/straight/build/straight | /home/berezhnev/.emacs.d/elpa/embark-consult-1.0 | /home/berezhnev/.emacs.d/elpa/consult-1.4 | /home/berezhnev/.emacs.d/elpa/embark-1.0 | /home/berezhnev/.emacs.d/elpa/compat-29.1.4.5 | /usr/share/emacs/29.3/site-lisp | /usr/share/emacs/site-lisp | /usr/share/emacs/29.3/lisp | /usr/share/emacs/29.3/lisp/vc | /usr/share/emacs/29.3/lisp/use-package | /usr/share/emacs/29.3/lisp/url | /usr/share/emacs/29.3/lisp/textmodes | /usr/share/emacs/29.3/lisp/progmodes | /usr/share/emacs/29.3/lisp/play | /usr/share/emacs/29.3/lisp/org | /usr/share/emacs/29.3/lisp/nxml | /usr/share/emacs/29.3/lisp/net | /usr/share/emacs/29.3/lisp/mh-e | /usr/share/emacs/29.3/lisp/mail | /usr/share/emacs/29.3/lisp/leim | /usr/share/emacs/29.3/lisp/language | /usr/share/emacs/29.3/lisp/international | /usr/share/emacs/29.3/lisp/image | /usr/share/emacs/29.3/lisp/gnus | /usr/share/emacs/29.3/lisp/eshell | /usr/share/emacs/29.3/lisp/erc | /usr/share/emacs/29.3/lisp/emulation | /usr/share/emacs/29.3/lisp/emacs-lisp | /usr/share/emacs/29.3/lisp/cedet | /usr/share/emacs/29.3/lisp/calendar | /usr/share/emacs/29.3/lisp/calc | /usr/share/emacs/29.3/lisp/obsolete |

** emacs-todoist (example)
#+begin_src example :lexical no
  (use-package todoist
    :config
    (setq todoist-token "3b3d5c7e6dbda3af71210b6c99680830e698372a"))
#+end_src

#+RESULTS:
: t

** Wakatime (example)
#+begin_src example :lexical no
  (use-package wakatime-mode
    :config
    (global-wakatime-mode))
#+end_src

#+RESULTS:
: wakatime-mode

** Performance (disabled)
#+begin_src example :lexical no

  ;; https://gitlab.com/shilling.jake/emacsd/-/blob/master/config.org
  (setq gc-cons-threshold most-positive-fixnum)

  (defconst 1mb 1048576)
  (defconst 20mb 20971520)
  (defconst 30mb 31457280)
  (defconst 50mb 52428800)

  (defun fk/defer-garbage-collection ()
    (setq gc-cons-threshold most-positive-fixnum))

  (defun fk/restore-garbage-collection ()
    (run-at-time 1 nil (lambda () (setq gc-cons-threshold 30mb))))

  (add-hook 'emacs-startup-hook 'fk/restore-garbage-collection)
  (add-hook 'minibuffer-setup-hook 'fk/defer-garbage-collection)
  (add-hook 'minibuffer-exit-hook 'fk/restore-garbage-collection)

  (setq read-process-output-max (* 3 1mb))  ;; lsp-mode's performance suggest

  (defvar default-file-name-handler-alist file-name-handler-alist)
  (setq file-name-handler-alist nil)

  (add-hook 'emacs-startup-hook
            (lambda ()
              (setq file-name-handler-alist default-file-name-handler-alist)))

  (setq frame-inhibit-implied-resize t)


  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  ;; ;;;;;;;;;;;;;;;;;;;;;;; ;;
  ;; ;; LSP optimizations ;; ;;
  ;; ;;;;;;;;;;;;;;;;;;;;;;; ;;
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

  (require 'cl-lib)
  (cl-declaim (optimize (speed 3) (safety 0)))
  (cl-defstruct my/struct counter)

  (define-inline test-counter-inc (self)
    (inline-letevals (self)
      (inline-quote
       (setf (my/struct-counter ,self) (1+ (my/struct-counter ,self))))))

  (require 'cl-lib)
  (cl-declaim (optimize (speed 3) (safety 0)))
  (cl-defstruct my/struct counter)

  (define-inline test-counter-inc (self)
    (inline-letevals (self)
      (inline-quote
       (setf (my/struct-counter ,self) (1+ (my/struct-counter ,self))))))

  (setq read-process-output-max (* 1024 1024))

  ;; Doom emacs:
  (defvar +lsp--default-read-process-output-max nil)
  (defvar +lsp--default-gcmh-high-cons-threshold nil)
  (defvar +lsp--optimization-init-p nil)

  (define-minor-mode +lsp-optimization-mode
    "Deploys universal GC and IPC optimizations for `lsp-mode' and `eglot'."
    :global t
    :init-value nil
    (if (not +lsp-optimization-mode)
        (setq-default read-process-output-max +lsp--default-read-process-output-max
                      gcmh-high-cons-threshold +lsp--default-gcmh-high-cons-threshold
                      +lsp--optimization-init-p nil)
      ;; Only apply these settings once!
      (unless +lsp--optimization-init-p
        (setq +lsp--default-read-process-output-max (default-value 'read-process-output-max)
              +lsp--default-gcmh-high-cons-threshold (default-value 'gcmh-high-cons-threshold))
        (setq-default read-process-output-max (* 1024 1024))
        ;; REVIEW LSP causes a lot of allocations, with or without the native JSON
        ;;        library, so we up the GC threshold to stave off GC-induced
        ;;        slowdowns/freezes. Doom uses `gcmh' to enforce its GC strategy,
        ;;        so we modify its variables rather than `gc-cons-threshold'
        ;;        directly.
        (setq-default gcmh-high-cons-threshold (* 2 +lsp--default-gcmh-high-cons-threshold))
        (gcmh-set-high-threshold)
        (setq +lsp--optimization-init-p t))))
#+end_src
